// Derived from the MIT-licensed ivankra/hsk30 character and vocabulary lists.
// The source lists cross-reference the official HSK 3.0 standard; this subset is stored locally so lessons never depend on the network.
import type { PrimaryGradeLevel } from "./catalog";

export interface ExpandedHanziSeed {
  level: PrimaryGradeLevel;
  char: string;
  words: readonly string[];
}

export const EXPANDED_HANZI_SEEDS: readonly ExpandedHanziSeed[] = [
  {
    "level": "G1",
    "char": "不",
    "words": [
      "不大",
      "不对",
      "不客气",
      "不用"
    ]
  },
  {
    "level": "G1",
    "char": "子",
    "words": [
      "包子",
      "杯子",
      "本子",
      "儿子"
    ]
  },
  {
    "level": "G1",
    "char": "出",
    "words": [
      "出来",
      "出去",
      "出发",
      "出国"
    ]
  },
  {
    "level": "G1",
    "char": "有",
    "words": [
      "还有",
      "没有",
      "有的",
      "有名"
    ]
  },
  {
    "level": "G1",
    "char": "生",
    "words": [
      "大学生",
      "男生",
      "女生",
      "生病"
    ]
  },
  {
    "level": "G1",
    "char": "地",
    "words": [
      "地点",
      "地方",
      "地上",
      "地图"
    ]
  },
  {
    "level": "G1",
    "char": "儿",
    "words": [
      "儿子",
      "好玩儿",
      "没事儿",
      "面条儿"
    ]
  },
  {
    "level": "G1",
    "char": "开",
    "words": [
      "打开",
      "开车",
      "开会",
      "开玩笑"
    ]
  },
  {
    "level": "G1",
    "char": "面",
    "words": [
      "见面",
      "面包",
      "面条儿",
      "对面"
    ]
  },
  {
    "level": "G1",
    "char": "得",
    "words": [
      "得到",
      "记得",
      "觉得",
      "得出"
    ]
  },
  {
    "level": "G1",
    "char": "分",
    "words": [
      "部分",
      "大部分",
      "分开",
      "分数"
    ]
  },
  {
    "level": "G1",
    "char": "好",
    "words": [
      "爱好",
      "好吃",
      "好看",
      "好听"
    ]
  },
  {
    "level": "G1",
    "char": "行",
    "words": [
      "不行",
      "进行",
      "举行",
      "流行"
    ]
  },
  {
    "level": "G1",
    "char": "会",
    "words": [
      "开会",
      "一会儿",
      "不一会儿",
      "机会"
    ]
  },
  {
    "level": "G1",
    "char": "说",
    "words": [
      "说话",
      "比如说",
      "说明",
      "听说"
    ]
  },
  {
    "level": "G1",
    "char": "用",
    "words": [
      "不用",
      "有用",
      "常用",
      "使用"
    ]
  },
  {
    "level": "G1",
    "char": "高",
    "words": [
      "高兴",
      "高级",
      "高中",
      "提高"
    ]
  },
  {
    "level": "G1",
    "char": "过",
    "words": [
      "不过",
      "超过",
      "过来",
      "过年"
    ]
  },
  {
    "level": "G1",
    "char": "机",
    "words": [
      "电视机",
      "飞机",
      "机场",
      "机票"
    ]
  },
  {
    "level": "G1",
    "char": "到",
    "words": [
      "得到",
      "回到",
      "看到",
      "来到"
    ]
  },
  {
    "level": "G1",
    "char": "年",
    "words": [
      "半年",
      "今年",
      "明年",
      "去年"
    ]
  },
  {
    "level": "G1",
    "char": "重",
    "words": [
      "重要",
      "重复",
      "重新",
      "重点"
    ]
  },
  {
    "level": "G1",
    "char": "打",
    "words": [
      "打车",
      "打电话",
      "打开",
      "打球"
    ]
  },
  {
    "level": "G1",
    "char": "期",
    "words": [
      "日期",
      "星期",
      "星期日",
      "星期天"
    ]
  },
  {
    "level": "G1",
    "char": "起",
    "words": [
      "对不起",
      "起床",
      "起来",
      "一起"
    ]
  },
  {
    "level": "G1",
    "char": "点",
    "words": [
      "地点",
      "一点儿",
      "点头",
      "观点"
    ]
  },
  {
    "level": "G1",
    "char": "场",
    "words": [
      "机场",
      "商场",
      "广场",
      "球场"
    ]
  },
  {
    "level": "G1",
    "char": "路",
    "words": [
      "路口",
      "路上",
      "马路",
      "走路"
    ]
  },
  {
    "level": "G1",
    "char": "见",
    "words": [
      "见面",
      "看见",
      "听见",
      "再见"
    ]
  },
  {
    "level": "G1",
    "char": "名",
    "words": [
      "名字",
      "有名",
      "报名",
      "名称"
    ]
  },
  {
    "level": "G1",
    "char": "道",
    "words": [
      "知道",
      "道理",
      "道路",
      "味道"
    ]
  },
  {
    "level": "G1",
    "char": "工",
    "words": [
      "工人",
      "工作",
      "打工",
      "工厂"
    ]
  },
  {
    "level": "G1",
    "char": "对",
    "words": [
      "不对",
      "对不起",
      "对话",
      "对面"
    ]
  },
  {
    "level": "G1",
    "char": "看",
    "words": [
      "好看",
      "看病",
      "看到",
      "看见"
    ]
  },
  {
    "level": "G1",
    "char": "能",
    "words": [
      "可能",
      "能够",
      "只能",
      "才能"
    ]
  },
  {
    "level": "G1",
    "char": "着",
    "words": [
      "接着",
      "睡着",
      "着火",
      "着急"
    ]
  },
  {
    "level": "G1",
    "char": "难",
    "words": [
      "难过",
      "难看",
      "难受",
      "难题"
    ]
  },
  {
    "level": "G1",
    "char": "是",
    "words": [
      "还是",
      "是不是",
      "但是",
      "可是"
    ]
  },
  {
    "level": "G1",
    "char": "本",
    "words": [
      "本子",
      "课本",
      "笔记本",
      "本来"
    ]
  },
  {
    "level": "G1",
    "char": "边",
    "words": [
      "北边",
      "东边",
      "后边",
      "里边"
    ]
  },
  {
    "level": "G1",
    "char": "话",
    "words": [
      "打电话",
      "电话",
      "说话",
      "的话"
    ]
  },
  {
    "level": "G1",
    "char": "回",
    "words": [
      "回答",
      "回到",
      "回家",
      "回来"
    ]
  },
  {
    "level": "G1",
    "char": "关",
    "words": [
      "关上",
      "没关系",
      "关机",
      "关心"
    ]
  },
  {
    "level": "G1",
    "char": "进",
    "words": [
      "进来",
      "进去",
      "请进",
      "进入"
    ]
  },
  {
    "level": "G1",
    "char": "新",
    "words": [
      "新年",
      "重新",
      "新闻",
      "创新"
    ]
  },
  {
    "level": "G1",
    "char": "要",
    "words": [
      "重要",
      "不要",
      "就要",
      "快要"
    ]
  },
  {
    "level": "G1",
    "char": "放",
    "words": [
      "放假",
      "放学",
      "放下",
      "放心"
    ]
  },
  {
    "level": "G1",
    "char": "文",
    "words": [
      "课文",
      "中文",
      "英文",
      "作文"
    ]
  },
  {
    "level": "G1",
    "char": "正",
    "words": [
      "正在",
      "真正",
      "正常",
      "正好"
    ]
  },
  {
    "level": "G1",
    "char": "别",
    "words": [
      "别的",
      "别人",
      "特别",
      "分别"
    ]
  },
  {
    "level": "G1",
    "char": "教",
    "words": [
      "教学楼",
      "教师",
      "教室",
      "教学"
    ]
  },
  {
    "level": "G1",
    "char": "热",
    "words": [
      "热情",
      "热爱",
      "热烈",
      "热闹"
    ]
  },
  {
    "level": "G1",
    "char": "视",
    "words": [
      "电视",
      "电视机",
      "重视",
      "电视剧"
    ]
  },
  {
    "level": "G1",
    "char": "常",
    "words": [
      "常常",
      "非常",
      "常见",
      "常用"
    ]
  },
  {
    "level": "G1",
    "char": "球",
    "words": [
      "打球",
      "地球",
      "篮球",
      "排球"
    ]
  },
  {
    "level": "G1",
    "char": "知",
    "words": [
      "知道",
      "知识",
      "通知",
      "通知书"
    ]
  },
  {
    "level": "G1",
    "char": "病",
    "words": [
      "病人",
      "看病",
      "生病",
      "毛病"
    ]
  },
  {
    "level": "G1",
    "char": "从",
    "words": [
      "从小",
      "从来",
      "从前",
      "从事"
    ]
  },
  {
    "level": "G1",
    "char": "假",
    "words": [
      "放假",
      "请假",
      "假期",
      "休假"
    ]
  },
  {
    "level": "G1",
    "char": "了",
    "words": [
      "除了",
      "极了",
      "为了",
      "了不起"
    ]
  },
  {
    "level": "G1",
    "char": "样",
    "words": [
      "一样",
      "那样",
      "什么样",
      "同样"
    ]
  },
  {
    "level": "G1",
    "char": "干",
    "words": [
      "干净",
      "干什么",
      "干杯",
      "干活儿"
    ]
  },
  {
    "level": "G1",
    "char": "就",
    "words": [
      "就要",
      "早就",
      "成就",
      "就是"
    ]
  },
  {
    "level": "G1",
    "char": "去",
    "words": [
      "出去",
      "回去",
      "进去",
      "去年"
    ]
  },
  {
    "level": "G1",
    "char": "笑",
    "words": [
      "开玩笑",
      "笑话",
      "笑话儿",
      "微笑"
    ]
  },
  {
    "level": "G1",
    "char": "在",
    "words": [
      "现在",
      "在家",
      "正在",
      "实在"
    ]
  },
  {
    "level": "G1",
    "char": "真",
    "words": [
      "认真",
      "真的",
      "真正",
      "真实"
    ]
  },
  {
    "level": "G1",
    "char": "字",
    "words": [
      "汉字",
      "名字",
      "数字",
      "字典"
    ]
  },
  {
    "level": "G1",
    "char": "服",
    "words": [
      "衣服",
      "服务",
      "舒服",
      "服装"
    ]
  },
  {
    "level": "G1",
    "char": "告",
    "words": [
      "告诉",
      "广告",
      "报告",
      "告别"
    ]
  },
  {
    "level": "G1",
    "char": "客",
    "words": [
      "不客气",
      "顾客",
      "客人",
      "旅客"
    ]
  },
  {
    "level": "G2",
    "char": "女",
    "words": [
      "女儿",
      "女孩儿",
      "女朋友",
      "女人"
    ]
  },
  {
    "level": "G2",
    "char": "爱",
    "words": [
      "爱好",
      "爱情",
      "爱人",
      "可爱"
    ]
  },
  {
    "level": "G2",
    "char": "歌",
    "words": [
      "唱歌",
      "歌迷",
      "歌声",
      "歌手"
    ]
  },
  {
    "level": "G2",
    "char": "号",
    "words": [
      "信号",
      "符号",
      "号码",
      "括号"
    ]
  },
  {
    "level": "G2",
    "char": "没",
    "words": [
      "没关系",
      "没什么",
      "没事儿",
      "没有"
    ]
  },
  {
    "level": "G2",
    "char": "商",
    "words": [
      "商场",
      "商店",
      "商量",
      "商人"
    ]
  },
  {
    "level": "G2",
    "char": "包",
    "words": [
      "包子",
      "面包",
      "钱包",
      "书包"
    ]
  },
  {
    "level": "G2",
    "char": "次",
    "words": [
      "上次",
      "下次",
      "其次",
      "多次"
    ]
  },
  {
    "level": "G2",
    "char": "和",
    "words": [
      "和平",
      "暖和",
      "温和",
      "和谐"
    ]
  },
  {
    "level": "G2",
    "char": "记",
    "words": [
      "记得",
      "记住",
      "忘记",
      "笔记"
    ]
  },
  {
    "level": "G2",
    "char": "听",
    "words": [
      "好听",
      "听到",
      "听见",
      "听写"
    ]
  },
  {
    "level": "G2",
    "char": "问",
    "words": [
      "请问",
      "问路",
      "问题",
      "访问"
    ]
  },
  {
    "level": "G2",
    "char": "果",
    "words": [
      "水果",
      "结果",
      "如果",
      "成果"
    ]
  },
  {
    "level": "G2",
    "char": "试",
    "words": [
      "考试",
      "试题",
      "试验",
      "测试"
    ]
  },
  {
    "level": "G2",
    "char": "影",
    "words": [
      "电影",
      "电影院",
      "影片",
      "影响"
    ]
  },
  {
    "level": "G2",
    "char": "远",
    "words": [
      "永远",
      "跳远",
      "远处",
      "长远"
    ]
  },
  {
    "level": "G2",
    "char": "白",
    "words": [
      "白天",
      "明白",
      "白色",
      "白菜"
    ]
  },
  {
    "level": "G2",
    "char": "觉",
    "words": [
      "觉得",
      "睡觉",
      "感觉",
      "自觉"
    ]
  },
  {
    "level": "G2",
    "char": "认",
    "words": [
      "认识",
      "认真",
      "认为",
      "否认"
    ]
  },
  {
    "level": "G2",
    "char": "图",
    "words": [
      "地图",
      "图书馆",
      "图片",
      "图画"
    ]
  },
  {
    "level": "G2",
    "char": "走",
    "words": [
      "走路",
      "走过",
      "走进",
      "走开"
    ]
  },
  {
    "level": "G2",
    "char": "半",
    "words": [
      "半年",
      "半天",
      "一半",
      "半夜"
    ]
  },
  {
    "level": "G2",
    "char": "备",
    "words": [
      "准备",
      "设备",
      "具备",
      "配备"
    ]
  },
  {
    "level": "G2",
    "char": "差",
    "words": [
      "差不多",
      "差别",
      "差距",
      "差点儿"
    ]
  },
  {
    "level": "G2",
    "char": "房",
    "words": [
      "房间",
      "房子",
      "住房",
      "房东"
    ]
  },
  {
    "level": "G2",
    "char": "冷",
    "words": [
      "寒冷",
      "冷静",
      "冷气",
      "冷水"
    ]
  },
  {
    "level": "G2",
    "char": "票",
    "words": [
      "车票",
      "机票",
      "门票",
      "票价"
    ]
  },
  {
    "level": "G2",
    "char": "钱",
    "words": [
      "钱包",
      "价钱",
      "挣钱",
      "金钱"
    ]
  },
  {
    "level": "G2",
    "char": "树",
    "words": [
      "树林",
      "树叶",
      "松树",
      "桃树"
    ]
  },
  {
    "level": "G2",
    "char": "条",
    "words": [
      "面条儿",
      "条件",
      "便条",
      "薯条"
    ]
  },
  {
    "level": "G2",
    "char": "喜",
    "words": [
      "喜欢",
      "喜爱",
      "喜剧",
      "惊喜"
    ]
  },
  {
    "level": "G2",
    "char": "的",
    "words": [
      "别的",
      "有的",
      "真的",
      "的话"
    ]
  },
  {
    "level": "G2",
    "char": "考",
    "words": [
      "考试",
      "考生",
      "考验",
      "参考"
    ]
  },
  {
    "level": "G2",
    "char": "识",
    "words": [
      "认识",
      "知识",
      "常识",
      "意识"
    ]
  },
  {
    "level": "G2",
    "char": "网",
    "words": [
      "上网",
      "网上",
      "网友",
      "网球"
    ]
  },
  {
    "level": "G2",
    "char": "住",
    "words": [
      "记住",
      "站住",
      "住房",
      "住院"
    ]
  },
  {
    "level": "G2",
    "char": "班",
    "words": [
      "上班",
      "下班",
      "班长",
      "班级"
    ]
  },
  {
    "level": "G2",
    "char": "饭",
    "words": [
      "吃饭",
      "饭店",
      "米饭",
      "晚饭"
    ]
  },
  {
    "level": "G2",
    "char": "非",
    "words": [
      "非常",
      "除非",
      "并非",
      "非金属"
    ]
  },
  {
    "level": "G2",
    "char": "个",
    "words": [
      "个子",
      "个人",
      "个性",
      "整个"
    ]
  },
  {
    "level": "G2",
    "char": "候",
    "words": [
      "时候",
      "有时候",
      "那时候",
      "小时候"
    ]
  },
  {
    "level": "G2",
    "char": "么",
    "words": [
      "干什么",
      "没什么",
      "什么",
      "怎么"
    ]
  },
  {
    "level": "G2",
    "char": "请",
    "words": [
      "请假",
      "请进",
      "请问",
      "请坐"
    ]
  },
  {
    "level": "G2",
    "char": "兴",
    "words": [
      "高兴",
      "感兴趣",
      "兴奋",
      "兴趣"
    ]
  },
  {
    "level": "G2",
    "char": "衣",
    "words": [
      "衣服",
      "大衣",
      "洗衣机",
      "衬衣"
    ]
  },
  {
    "level": "G2",
    "char": "准",
    "words": [
      "准备",
      "准确",
      "标准",
      "批准"
    ]
  },
  {
    "level": "G2",
    "char": "错",
    "words": [
      "不错",
      "错误",
      "没错",
      "错过"
    ]
  },
  {
    "level": "G2",
    "char": "课",
    "words": [
      "课本",
      "课文",
      "上课",
      "下课"
    ]
  },
  {
    "level": "G2",
    "char": "楼",
    "words": [
      "教学楼",
      "楼上",
      "楼下",
      "大楼"
    ]
  },
  {
    "level": "G2",
    "char": "息",
    "words": [
      "休息",
      "信息",
      "消息",
      "利息"
    ]
  },
  {
    "level": "G2",
    "char": "院",
    "words": [
      "电影院",
      "学院",
      "医院",
      "出院"
    ]
  },
  {
    "level": "G2",
    "char": "吃",
    "words": [
      "吃饭",
      "好吃",
      "吃惊",
      "小吃"
    ]
  },
  {
    "level": "G2",
    "char": "等",
    "words": [
      "等到",
      "等于",
      "平等",
      "等待"
    ]
  },
  {
    "level": "G2",
    "char": "馆",
    "words": [
      "图书馆",
      "饭馆",
      "体育馆",
      "大使馆"
    ]
  },
  {
    "level": "G2",
    "char": "欢",
    "words": [
      "喜欢",
      "欢迎",
      "欢乐",
      "悲欢离合"
    ]
  },
  {
    "level": "G2",
    "char": "送",
    "words": [
      "送到",
      "送给",
      "发送",
      "赠送"
    ]
  },
  {
    "level": "G2",
    "char": "写",
    "words": [
      "听写",
      "写作",
      "抄写",
      "描写"
    ]
  },
  {
    "level": "G2",
    "char": "这",
    "words": [
      "这边",
      "这里",
      "这儿",
      "这些"
    ]
  },
  {
    "level": "G2",
    "char": "读",
    "words": [
      "读书",
      "读音",
      "读者",
      "阅读"
    ]
  },
  {
    "level": "G2",
    "char": "飞",
    "words": [
      "飞机",
      "起飞",
      "飞行",
      "飞船"
    ]
  },
  {
    "level": "G2",
    "char": "贵",
    "words": [
      "宝贵",
      "珍贵",
      "昂贵",
      "高贵"
    ]
  },
  {
    "level": "G2",
    "char": "今",
    "words": [
      "今年",
      "今天",
      "今后",
      "至今"
    ]
  },
  {
    "level": "G2",
    "char": "忙",
    "words": [
      "帮忙",
      "连忙",
      "急忙",
      "慌忙"
    ]
  },
  {
    "level": "G2",
    "char": "那",
    "words": [
      "那边",
      "那里",
      "那儿",
      "那些"
    ]
  },
  {
    "level": "G2",
    "char": "太",
    "words": [
      "不太",
      "太太",
      "太阳",
      "老太太"
    ]
  },
  {
    "level": "G2",
    "char": "元",
    "words": [
      "单元",
      "美元",
      "公元",
      "元旦"
    ]
  },
  {
    "level": "G2",
    "char": "再",
    "words": [
      "再见",
      "一再",
      "再三",
      "再次"
    ]
  },
  {
    "level": "G2",
    "char": "店",
    "words": [
      "饭店",
      "商店",
      "书店",
      "酒店"
    ]
  },
  {
    "level": "G2",
    "char": "跑",
    "words": [
      "跑步",
      "逃跑",
      "奔跑",
      "长跑"
    ]
  },
  {
    "level": "G2",
    "char": "玩",
    "words": [
      "好玩儿",
      "开玩笑",
      "玩儿",
      "玩具"
    ]
  },
  {
    "level": "G2",
    "char": "休",
    "words": [
      "休息",
      "休假",
      "退休",
      "休闲"
    ]
  },
  {
    "level": "G2",
    "char": "医",
    "words": [
      "医生",
      "医院",
      "西医",
      "中医"
    ]
  },
  {
    "level": "G2",
    "char": "还",
    "words": [
      "还是",
      "还有",
      "偿还",
      "返还"
    ]
  },
  {
    "level": "G2",
    "char": "坏",
    "words": [
      "坏处",
      "坏人",
      "破坏",
      "好坏"
    ]
  },
  {
    "level": "G2",
    "char": "毛",
    "words": [
      "毛病",
      "毛巾",
      "毛衣",
      "毛笔"
    ]
  },
  {
    "level": "G2",
    "char": "们",
    "words": [
      "朋友们",
      "你们",
      "他们",
      "她们"
    ]
  },
  {
    "level": "G3",
    "char": "男",
    "words": [
      "男孩儿",
      "男朋友",
      "男人",
      "男生"
    ]
  },
  {
    "level": "G3",
    "char": "脑",
    "words": [
      "电脑",
      "头脑",
      "脑袋",
      "大脑"
    ]
  },
  {
    "level": "G3",
    "char": "洗",
    "words": [
      "洗手间",
      "洗衣机",
      "洗澡",
      "清洗"
    ]
  },
  {
    "level": "G3",
    "char": "站",
    "words": [
      "车站",
      "地铁站",
      "网站",
      "站住"
    ]
  },
  {
    "level": "G3",
    "char": "做",
    "words": [
      "做到",
      "做法",
      "做饭",
      "做客"
    ]
  },
  {
    "level": "G3",
    "char": "百",
    "words": [
      "老百姓",
      "百货",
      "百分点",
      "百分比"
    ]
  },
  {
    "level": "G3",
    "char": "唱",
    "words": [
      "唱歌",
      "演唱",
      "演唱会",
      "唱片"
    ]
  },
  {
    "level": "G3",
    "char": "答",
    "words": [
      "回答",
      "答应",
      "答案",
      "报答"
    ]
  },
  {
    "level": "G3",
    "char": "两",
    "words": [
      "两边",
      "两岸",
      "两侧",
      "两手"
    ]
  },
  {
    "level": "G3",
    "char": "零",
    "words": [
      "零下",
      "零食",
      "孤零零",
      "零花钱"
    ]
  },
  {
    "level": "G3",
    "char": "慢",
    "words": [
      "慢慢",
      "慢车",
      "傲慢",
      "怠慢"
    ]
  },
  {
    "level": "G3",
    "char": "米",
    "words": [
      "米饭",
      "毫米",
      "厘米",
      "玉米"
    ]
  },
  {
    "level": "G3",
    "char": "诉",
    "words": [
      "告诉",
      "投诉",
      "起诉",
      "倾诉"
    ]
  },
  {
    "level": "G3",
    "char": "忘",
    "words": [
      "忘记",
      "难忘",
      "废寝忘食",
      "念念不忘"
    ]
  },
  {
    "level": "G3",
    "char": "系",
    "words": [
      "没关系",
      "关系",
      "联系",
      "系列"
    ]
  },
  {
    "level": "G3",
    "char": "茶",
    "words": [
      "红茶",
      "绿茶",
      "奶茶",
      "茶叶"
    ]
  },
  {
    "level": "G3",
    "char": "穿",
    "words": [
      "穿上",
      "穿过",
      "穿小鞋",
      "穿越"
    ]
  },
  {
    "level": "G3",
    "char": "给",
    "words": [
      "交给",
      "送给",
      "递给",
      "供给"
    ]
  },
  {
    "level": "G3",
    "char": "跟",
    "words": [
      "高跟鞋",
      "跟前",
      "跟随",
      "跟不上"
    ]
  },
  {
    "level": "G3",
    "char": "奶",
    "words": [
      "奶奶",
      "牛奶",
      "奶茶",
      "酸奶"
    ]
  },
  {
    "level": "G3",
    "char": "睡",
    "words": [
      "睡觉",
      "午睡",
      "睡着",
      "睡眠"
    ]
  },
  {
    "level": "G3",
    "char": "午",
    "words": [
      "上午",
      "午饭",
      "下午",
      "中午"
    ]
  },
  {
    "level": "G3",
    "char": "些",
    "words": [
      "哪些",
      "那些",
      "一些",
      "有些"
    ]
  },
  {
    "level": "G3",
    "char": "最",
    "words": [
      "最好",
      "最后",
      "最近",
      "最初"
    ]
  },
  {
    "level": "G3",
    "char": "蛋",
    "words": [
      "鸡蛋",
      "蛋糕",
      "笨蛋",
      "蛋白质"
    ]
  },
  {
    "level": "G3",
    "char": "弟",
    "words": [
      "弟弟",
      "兄弟",
      "徒弟",
      "弟子"
    ]
  },
  {
    "level": "G3",
    "char": "都",
    "words": [
      "首都",
      "大都",
      "全都",
      "都市"
    ]
  },
  {
    "level": "G3",
    "char": "介",
    "words": [
      "介绍",
      "中介",
      "简介",
      "介入"
    ]
  },
  {
    "level": "G3",
    "char": "净",
    "words": [
      "干净",
      "纯净水",
      "洁净",
      "净化"
    ]
  },
  {
    "level": "G3",
    "char": "累",
    "words": [
      "积累",
      "劳累",
      "累积",
      "累计"
    ]
  },
  {
    "level": "G3",
    "char": "拿",
    "words": [
      "拿出",
      "拿到",
      "拿走",
      "拿手"
    ]
  },
  {
    "level": "G3",
    "char": "哪",
    "words": [
      "哪里",
      "哪儿",
      "哪些",
      "哪怕"
    ]
  },
  {
    "level": "G3",
    "char": "怎",
    "words": [
      "怎么",
      "怎么办",
      "怎么样",
      "怎样"
    ]
  },
  {
    "level": "G3",
    "char": "杯",
    "words": [
      "杯子",
      "干杯",
      "世界杯",
      "奖杯"
    ]
  },
  {
    "level": "G3",
    "char": "菜",
    "words": [
      "菜单",
      "白菜",
      "蔬菜",
      "菜市场"
    ]
  },
  {
    "level": "G3",
    "char": "床",
    "words": [
      "起床",
      "病床",
      "床位",
      "临床"
    ]
  },
  {
    "level": "G3",
    "char": "鸡",
    "words": [
      "鸡蛋",
      "公鸡",
      "母鸡",
      "鹤立鸡群"
    ]
  },
  {
    "level": "G3",
    "char": "姐",
    "words": [
      "姐姐",
      "小姐",
      "大姐",
      "姐妹"
    ]
  },
  {
    "level": "G3",
    "char": "买",
    "words": [
      "购买",
      "买卖",
      "买不起",
      "收买"
    ]
  },
  {
    "level": "G3",
    "char": "旁",
    "words": [
      "旁边",
      "旁观",
      "袖手旁观",
      "一旁"
    ]
  },
  {
    "level": "G3",
    "char": "什",
    "words": [
      "干什么",
      "没什么",
      "什么",
      "什么样"
    ]
  },
  {
    "level": "G3",
    "char": "他",
    "words": [
      "他们",
      "其他",
      "吉他",
      "他人"
    ]
  },
  {
    "level": "G3",
    "char": "也",
    "words": [
      "也许",
      "也好",
      "再也",
      "也就是说"
    ]
  },
  {
    "level": "G3",
    "char": "找",
    "words": [
      "找到",
      "找出",
      "寻找",
      "查找"
    ]
  },
  {
    "level": "G3",
    "char": "坐",
    "words": [
      "请坐",
      "坐下",
      "乘坐",
      "坐落"
    ]
  },
  {
    "level": "G3",
    "char": "第",
    "words": [
      "第二",
      "第一手",
      "第一线"
    ]
  },
  {
    "level": "G3",
    "char": "哥",
    "words": [
      "哥哥",
      "大哥",
      "帅哥"
    ]
  },
  {
    "level": "G3",
    "char": "孩",
    "words": [
      "孩子",
      "男孩儿",
      "女孩儿",
      "小孩儿"
    ]
  },
  {
    "level": "G3",
    "char": "几",
    "words": [
      "几乎",
      "几率",
      "寥寥无几"
    ]
  },
  {
    "level": "G3",
    "char": "叫",
    "words": [
      "叫作",
      "叫板",
      "叫好"
    ]
  },
  {
    "level": "G3",
    "char": "汽",
    "words": [
      "汽车",
      "公共汽车",
      "汽水",
      "汽油"
    ]
  },
  {
    "level": "G3",
    "char": "吧",
    "words": [
      "酒吧",
      "网吧"
    ]
  },
  {
    "level": "G3",
    "char": "饿",
    "words": [
      "饥饿",
      "忍饥挨饿"
    ]
  },
  {
    "level": "G3",
    "char": "汉",
    "words": [
      "汉语",
      "汉字",
      "老汉"
    ]
  },
  {
    "level": "G3",
    "char": "喝",
    "words": [
      "吃喝玩乐",
      "喝彩"
    ]
  },
  {
    "level": "G3",
    "char": "块",
    "words": [
      "一块儿",
      "板块"
    ]
  },
  {
    "level": "G3",
    "char": "妈",
    "words": [
      "妈妈",
      "大妈"
    ]
  },
  {
    "level": "G3",
    "char": "妹",
    "words": [
      "妹妹",
      "姐妹"
    ]
  },
  {
    "level": "G3",
    "char": "肉",
    "words": [
      "肌肉",
      "烤肉"
    ]
  },
  {
    "level": "G3",
    "char": "岁",
    "words": [
      "岁月",
      "岁数"
    ]
  },
  {
    "level": "G3",
    "char": "我",
    "words": [
      "我们",
      "自我"
    ]
  },
  {
    "level": "G3",
    "char": "谢",
    "words": [
      "谢谢",
      "感谢",
      "新陈代谢"
    ]
  },
  {
    "level": "G3",
    "char": "爷",
    "words": [
      "爷爷",
      "大爷",
      "姥爷"
    ]
  },
  {
    "level": "G3",
    "char": "页",
    "words": [
      "网页",
      "主页"
    ]
  },
  {
    "level": "G3",
    "char": "桌",
    "words": [
      "桌子",
      "书桌",
      "餐桌"
    ]
  },
  {
    "level": "G3",
    "char": "京",
    "words": [
      "北京",
      "京剧"
    ]
  },
  {
    "level": "G3",
    "char": "心",
    "words": [
      "放心",
      "关心",
      "开心",
      "小心"
    ]
  },
  {
    "level": "G3",
    "char": "头",
    "words": [
      "点头",
      "里头",
      "头发",
      "老头儿"
    ]
  },
  {
    "level": "G3",
    "char": "力",
    "words": [
      "努力",
      "动力",
      "力量",
      "能力"
    ]
  },
  {
    "level": "G3",
    "char": "意",
    "words": [
      "不好意思",
      "故意",
      "满意",
      "意见"
    ]
  },
  {
    "level": "G3",
    "char": "成",
    "words": [
      "变成",
      "成绩",
      "成为",
      "完成"
    ]
  },
  {
    "level": "G3",
    "char": "自",
    "words": [
      "大自然",
      "来自",
      "自己",
      "自行车"
    ]
  },
  {
    "level": "G3",
    "char": "公",
    "words": [
      "办公室",
      "公共汽车",
      "公交车",
      "公斤"
    ]
  },
  {
    "level": "G3",
    "char": "长",
    "words": [
      "班长",
      "队长",
      "家长",
      "市长"
    ]
  },
  {
    "level": "G4",
    "char": "理",
    "words": [
      "道理",
      "经理",
      "理想",
      "办理"
    ]
  },
  {
    "level": "G4",
    "char": "定",
    "words": [
      "不一定",
      "一定",
      "定期",
      "否定"
    ]
  },
  {
    "level": "G4",
    "char": "实",
    "words": [
      "实际",
      "实习",
      "实现",
      "实在"
    ]
  },
  {
    "level": "G4",
    "char": "情",
    "words": [
      "爱情",
      "热情",
      "事情",
      "心情"
    ]
  },
  {
    "level": "G4",
    "char": "相",
    "words": [
      "相同",
      "相信",
      "相机",
      "照相"
    ]
  },
  {
    "level": "G4",
    "char": "于",
    "words": [
      "等于",
      "属于",
      "由于",
      "终于"
    ]
  },
  {
    "level": "G4",
    "char": "可",
    "words": [
      "可爱",
      "可能",
      "可怕",
      "可是"
    ]
  },
  {
    "level": "G4",
    "char": "主",
    "words": [
      "主人",
      "主要",
      "主持",
      "主动"
    ]
  },
  {
    "level": "G4",
    "char": "当",
    "words": [
      "当时",
      "当初",
      "当地",
      "当然"
    ]
  },
  {
    "level": "G4",
    "char": "通",
    "words": [
      "交通",
      "普通",
      "普通话",
      "通过"
    ]
  },
  {
    "level": "G4",
    "char": "然",
    "words": [
      "大自然",
      "忽然",
      "然后",
      "虽然"
    ]
  },
  {
    "level": "G4",
    "char": "交",
    "words": [
      "公交车",
      "交给",
      "交朋友",
      "交通"
    ]
  },
  {
    "level": "G4",
    "char": "度",
    "words": [
      "角度",
      "态度",
      "温度",
      "程度"
    ]
  },
  {
    "level": "G4",
    "char": "为",
    "words": [
      "成为",
      "认为",
      "为什么",
      "行为"
    ]
  },
  {
    "level": "G4",
    "char": "信",
    "words": [
      "短信",
      "相信",
      "信号",
      "信息"
    ]
  },
  {
    "level": "G4",
    "char": "处",
    "words": [
      "到处",
      "好处",
      "坏处",
      "长处"
    ]
  },
  {
    "level": "G4",
    "char": "收",
    "words": [
      "收到",
      "收入",
      "收费",
      "收看"
    ]
  },
  {
    "level": "G4",
    "char": "以",
    "words": [
      "可以",
      "所以",
      "以后",
      "以前"
    ]
  },
  {
    "level": "G4",
    "char": "流",
    "words": [
      "流利",
      "流行",
      "交流",
      "潮流"
    ]
  },
  {
    "level": "G4",
    "char": "平",
    "words": [
      "公平",
      "平安",
      "平常",
      "平等"
    ]
  },
  {
    "level": "G4",
    "char": "物",
    "words": [
      "动物",
      "动物园",
      "礼物",
      "食物"
    ]
  },
  {
    "level": "G4",
    "char": "感",
    "words": [
      "感到",
      "感动",
      "感觉",
      "感谢"
    ]
  },
  {
    "level": "G4",
    "char": "法",
    "words": [
      "办法",
      "方法",
      "看法",
      "想法"
    ]
  },
  {
    "level": "G4",
    "char": "接",
    "words": [
      "接到",
      "接受",
      "接下来",
      "接着"
    ]
  },
  {
    "level": "G4",
    "char": "全",
    "words": [
      "安全",
      "全部",
      "全国",
      "全家"
    ]
  },
  {
    "level": "G4",
    "char": "入",
    "words": [
      "进入",
      "入口",
      "收入",
      "深入"
    ]
  },
  {
    "level": "G4",
    "char": "而",
    "words": [
      "而且",
      "而是",
      "反而",
      "然而"
    ]
  },
  {
    "level": "G4",
    "char": "如",
    "words": [
      "比如",
      "比如说",
      "不如",
      "例如"
    ]
  },
  {
    "level": "G4",
    "char": "业",
    "words": [
      "作业",
      "创业",
      "工业",
      "就业"
    ]
  },
  {
    "level": "G4",
    "char": "报",
    "words": [
      "报名",
      "报纸",
      "日报",
      "晚报"
    ]
  },
  {
    "level": "G4",
    "char": "量",
    "words": [
      "大量",
      "商量",
      "尽量",
      "力量"
    ]
  },
  {
    "level": "G4",
    "char": "部",
    "words": [
      "部分",
      "大部分",
      "全部",
      "一部分"
    ]
  },
  {
    "level": "G4",
    "char": "经",
    "words": [
      "经常",
      "经过",
      "经理",
      "已经"
    ]
  },
  {
    "level": "G4",
    "char": "利",
    "words": [
      "流利",
      "顺利",
      "利用",
      "胜利"
    ]
  },
  {
    "level": "G4",
    "char": "所",
    "words": [
      "所以",
      "所有",
      "场所",
      "所长"
    ]
  },
  {
    "level": "G4",
    "char": "眼",
    "words": [
      "眼睛",
      "眼前",
      "眼镜",
      "眼泪"
    ]
  },
  {
    "level": "G4",
    "char": "空",
    "words": [
      "空气",
      "有空儿",
      "空调",
      "空儿"
    ]
  },
  {
    "level": "G4",
    "char": "数",
    "words": [
      "大多数",
      "多数",
      "分数",
      "人数"
    ]
  },
  {
    "level": "G4",
    "char": "表",
    "words": [
      "表示",
      "手表",
      "表达",
      "表格"
    ]
  },
  {
    "level": "G4",
    "char": "加",
    "words": [
      "参加",
      "加油",
      "更加",
      "加工"
    ]
  },
  {
    "level": "G4",
    "char": "结",
    "words": [
      "结果",
      "结实",
      "结合",
      "结婚"
    ]
  },
  {
    "level": "G4",
    "char": "求",
    "words": [
      "请求",
      "要求",
      "需求",
      "征求"
    ]
  },
  {
    "level": "G4",
    "char": "取",
    "words": [
      "取得",
      "采取",
      "取消",
      "争取"
    ]
  },
  {
    "level": "G4",
    "char": "提",
    "words": [
      "提出",
      "提到",
      "提高",
      "提前"
    ]
  },
  {
    "level": "G4",
    "char": "位",
    "words": [
      "单位",
      "座位",
      "各位",
      "地位"
    ]
  },
  {
    "level": "G4",
    "char": "受",
    "words": [
      "接受",
      "难受",
      "受到",
      "感受"
    ]
  },
  {
    "level": "G4",
    "char": "特",
    "words": [
      "特别",
      "特点",
      "特色",
      "独特"
    ]
  },
  {
    "level": "G4",
    "char": "应",
    "words": [
      "答应",
      "应该",
      "反应",
      "适应"
    ]
  },
  {
    "level": "G4",
    "char": "论",
    "words": [
      "讨论",
      "不论",
      "理论",
      "辩论"
    ]
  },
  {
    "level": "G4",
    "char": "养",
    "words": [
      "营养",
      "疗养",
      "培养",
      "养成"
    ]
  },
  {
    "level": "G4",
    "char": "原",
    "words": [
      "原来",
      "原因",
      "原料",
      "原则"
    ]
  },
  {
    "level": "G4",
    "char": "照",
    "words": [
      "护照",
      "照顾",
      "照片",
      "照相"
    ]
  },
  {
    "level": "G4",
    "char": "复",
    "words": [
      "重复",
      "复习",
      "反复",
      "复印"
    ]
  },
  {
    "level": "G4",
    "char": "务",
    "words": [
      "服务",
      "公务员",
      "任务",
      "服务员"
    ]
  },
  {
    "level": "G4",
    "char": "带",
    "words": [
      "带来",
      "带动",
      "带领",
      "带有"
    ]
  },
  {
    "level": "G4",
    "char": "计",
    "words": [
      "计划",
      "计算机",
      "计算",
      "设计"
    ]
  },
  {
    "level": "G4",
    "char": "画",
    "words": [
      "画家",
      "画儿",
      "图画",
      "动画片"
    ]
  },
  {
    "level": "G4",
    "char": "清",
    "words": [
      "清楚",
      "清醒",
      "清晨",
      "清理"
    ]
  },
  {
    "level": "G4",
    "char": "推",
    "words": [
      "推动",
      "推广",
      "推进",
      "推开"
    ]
  },
  {
    "level": "G4",
    "char": "往",
    "words": [
      "交往",
      "前往",
      "往往",
      "以往"
    ]
  },
  {
    "level": "G4",
    "char": "办",
    "words": [
      "办法",
      "办公室",
      "怎么办",
      "办理"
    ]
  },
  {
    "level": "G4",
    "char": "变",
    "words": [
      "变成",
      "改变",
      "变化",
      "变为"
    ]
  },
  {
    "level": "G4",
    "char": "单",
    "words": [
      "菜单",
      "单位",
      "名单",
      "单元"
    ]
  },
  {
    "level": "G4",
    "char": "改",
    "words": [
      "改变",
      "改进",
      "改造",
      "修改"
    ]
  },
  {
    "level": "G4",
    "char": "近",
    "words": [
      "最近",
      "将近",
      "接近",
      "近期"
    ]
  },
  {
    "level": "G4",
    "char": "举",
    "words": [
      "举手",
      "举行",
      "举办",
      "举动"
    ]
  },
  {
    "level": "G4",
    "char": "科",
    "words": [
      "科学家",
      "科学",
      "科技",
      "本科"
    ]
  },
  {
    "level": "G4",
    "char": "片",
    "words": [
      "图片",
      "药片",
      "影片",
      "照片"
    ]
  },
  {
    "level": "G4",
    "char": "顺",
    "words": [
      "顺利",
      "一路顺风",
      "顺序",
      "顺便"
    ]
  },
  {
    "level": "G4",
    "char": "思",
    "words": [
      "不好意思",
      "意思",
      "有意思",
      "思想"
    ]
  },
  {
    "level": "G4",
    "char": "算",
    "words": [
      "打算",
      "计算机",
      "计算",
      "总算"
    ]
  },
  {
    "level": "G4",
    "char": "选",
    "words": [
      "选手",
      "挑选",
      "选择",
      "当选"
    ]
  },
  {
    "level": "G4",
    "char": "夜",
    "words": [
      "半夜",
      "夜里",
      "夜间",
      "黑夜"
    ]
  },
  {
    "level": "G4",
    "char": "直",
    "words": [
      "一直",
      "直接",
      "简直",
      "直播"
    ]
  },
  {
    "level": "G4",
    "char": "装",
    "words": [
      "安装",
      "服装",
      "装修",
      "装置"
    ]
  },
  {
    "level": "G4",
    "char": "便",
    "words": [
      "方便",
      "方便面",
      "便宜",
      "随便"
    ]
  },
  {
    "level": "G4",
    "char": "活",
    "words": [
      "干活儿",
      "活动",
      "生活",
      "活力"
    ]
  },
  {
    "level": "G5",
    "char": "留",
    "words": [
      "留下",
      "留学生",
      "保留",
      "留学"
    ]
  },
  {
    "level": "G5",
    "char": "其",
    "words": [
      "其他",
      "其中",
      "其次",
      "其实"
    ]
  },
  {
    "level": "G5",
    "char": "示",
    "words": [
      "表示",
      "显示",
      "暗示",
      "示范"
    ]
  },
  {
    "level": "G5",
    "char": "味",
    "words": [
      "味道",
      "味儿",
      "意味着",
      "风味"
    ]
  },
  {
    "level": "G5",
    "char": "游",
    "words": [
      "旅游",
      "游客",
      "游戏",
      "游泳"
    ]
  },
  {
    "level": "G5",
    "char": "队",
    "words": [
      "队长",
      "排队",
      "球队",
      "队员"
    ]
  },
  {
    "level": "G5",
    "char": "红",
    "words": [
      "红色",
      "红茶",
      "红酒",
      "红包"
    ]
  },
  {
    "level": "G5",
    "char": "级",
    "words": [
      "高级",
      "年级",
      "中级",
      "班级"
    ]
  },
  {
    "level": "G5",
    "char": "急",
    "words": [
      "紧急",
      "急忙",
      "着急",
      "急救"
    ]
  },
  {
    "level": "G5",
    "char": "食",
    "words": [
      "食物",
      "美食",
      "食品",
      "粮食"
    ]
  },
  {
    "level": "G5",
    "char": "随",
    "words": [
      "随便",
      "随时",
      "随手",
      "跟随"
    ]
  },
  {
    "level": "G5",
    "char": "题",
    "words": [
      "难题",
      "问题",
      "标题",
      "话题"
    ]
  },
  {
    "level": "G5",
    "char": "温",
    "words": [
      "气温",
      "温度",
      "温暖",
      "降温"
    ]
  },
  {
    "level": "G5",
    "char": "餐",
    "words": [
      "快餐",
      "晚餐",
      "午餐",
      "西餐"
    ]
  },
  {
    "level": "G5",
    "char": "倒",
    "words": [
      "倒闭",
      "倒车",
      "倒是",
      "摔倒"
    ]
  },
  {
    "level": "G5",
    "char": "共",
    "words": [
      "公共汽车",
      "一共",
      "公共",
      "共同"
    ]
  },
  {
    "level": "G5",
    "char": "顾",
    "words": [
      "顾客",
      "照顾",
      "不顾",
      "顾问"
    ]
  },
  {
    "level": "G5",
    "char": "件",
    "words": [
      "条件",
      "电子邮件",
      "事件",
      "文件"
    ]
  },
  {
    "level": "G5",
    "char": "使",
    "words": [
      "使用",
      "大使馆",
      "促使",
      "使劲"
    ]
  },
  {
    "level": "G5",
    "char": "酒",
    "words": [
      "酒店",
      "红酒",
      "啤酒",
      "酒吧"
    ]
  },
  {
    "level": "G5",
    "char": "离",
    "words": [
      "离开",
      "离婚",
      "距离",
      "离不开"
    ]
  },
  {
    "level": "G5",
    "char": "礼",
    "words": [
      "礼物",
      "婚礼",
      "典礼",
      "礼拜"
    ]
  },
  {
    "level": "G5",
    "char": "必",
    "words": [
      "必须",
      "必然",
      "必要",
      "不必"
    ]
  },
  {
    "level": "G5",
    "char": "称",
    "words": [
      "名称",
      "称为",
      "称赞",
      "称号"
    ]
  },
  {
    "level": "G5",
    "char": "低",
    "words": [
      "降低",
      "低于",
      "低头",
      "低温"
    ]
  },
  {
    "level": "G5",
    "char": "确",
    "words": [
      "正确",
      "准确",
      "明确",
      "确保"
    ]
  },
  {
    "level": "G5",
    "char": "室",
    "words": [
      "办公室",
      "教室",
      "实验室",
      "卧室"
    ]
  },
  {
    "level": "G5",
    "char": "停",
    "words": [
      "停车",
      "停车场",
      "停止",
      "停下"
    ]
  },
  {
    "level": "G5",
    "char": "换",
    "words": [
      "交换",
      "更换",
      "转换",
      "变换"
    ]
  },
  {
    "level": "G5",
    "char": "久",
    "words": [
      "不久",
      "多久",
      "好久",
      "长久"
    ]
  },
  {
    "level": "G5",
    "char": "市",
    "words": [
      "超市",
      "市长",
      "城市",
      "市场"
    ]
  },
  {
    "level": "G5",
    "char": "万",
    "words": [
      "千万",
      "万一",
      "成千上万",
      "鹏程万里"
    ]
  },
  {
    "level": "G5",
    "char": "药",
    "words": [
      "药店",
      "药片",
      "药水",
      "药物"
    ]
  },
  {
    "level": "G5",
    "char": "由",
    "words": [
      "自由",
      "理由",
      "由于",
      "由此"
    ]
  },
  {
    "level": "G5",
    "char": "周",
    "words": [
      "上周",
      "下周",
      "周末",
      "周年"
    ]
  },
  {
    "level": "G5",
    "char": "查",
    "words": [
      "检查",
      "调查",
      "查询",
      "查出"
    ]
  },
  {
    "level": "G5",
    "char": "短",
    "words": [
      "短信",
      "短处",
      "短裤",
      "短期"
    ]
  },
  {
    "level": "G5",
    "char": "满",
    "words": [
      "不满",
      "满意",
      "充满",
      "满足"
    ]
  },
  {
    "level": "G5",
    "char": "排",
    "words": [
      "排队",
      "排球",
      "安排",
      "排名"
    ]
  },
  {
    "level": "G5",
    "char": "完",
    "words": [
      "完成",
      "完全",
      "完美",
      "完善"
    ]
  },
  {
    "level": "G5",
    "char": "闻",
    "words": [
      "新闻",
      "丑闻",
      "传闻",
      "耳闻目睹"
    ]
  },
  {
    "level": "G5",
    "char": "像",
    "words": [
      "好像",
      "偶像",
      "摄像",
      "摄像机"
    ]
  },
  {
    "level": "G5",
    "char": "园",
    "words": [
      "动物园",
      "公园",
      "花园",
      "校园"
    ]
  },
  {
    "level": "G5",
    "char": "者",
    "words": [
      "或者",
      "读者",
      "记者",
      "志愿者"
    ]
  },
  {
    "level": "G5",
    "char": "只",
    "words": [
      "只能",
      "只要",
      "只好",
      "只是"
    ]
  },
  {
    "level": "G5",
    "char": "超",
    "words": [
      "超过",
      "超市",
      "超级",
      "超越"
    ]
  },
  {
    "level": "G5",
    "char": "例",
    "words": [
      "例如",
      "例子",
      "比例",
      "例外"
    ]
  },
  {
    "level": "G5",
    "char": "适",
    "words": [
      "合适",
      "适合",
      "适应",
      "适用"
    ]
  },
  {
    "level": "G5",
    "char": "态",
    "words": [
      "态度",
      "状态",
      "动态",
      "心态"
    ]
  },
  {
    "level": "G5",
    "char": "讨",
    "words": [
      "讨论",
      "讨厌",
      "探讨",
      "检讨"
    ]
  },
  {
    "level": "G5",
    "char": "许",
    "words": [
      "许多",
      "也许",
      "或许",
      "不许"
    ]
  },
  {
    "level": "G5",
    "char": "组",
    "words": [
      "小组",
      "组成",
      "组长",
      "分组"
    ]
  },
  {
    "level": "G5",
    "char": "背",
    "words": [
      "背后",
      "背景",
      "背包",
      "背心"
    ]
  },
  {
    "level": "G5",
    "char": "参",
    "words": [
      "参观",
      "参加",
      "参考",
      "参与"
    ]
  },
  {
    "level": "G5",
    "char": "灯",
    "words": [
      "灯光",
      "电灯",
      "台灯",
      "灯笼"
    ]
  },
  {
    "level": "G5",
    "char": "典",
    "words": [
      "词典",
      "字典",
      "典型",
      "经典"
    ]
  },
  {
    "level": "G5",
    "char": "广",
    "words": [
      "广场",
      "广告",
      "广播",
      "广大"
    ]
  },
  {
    "level": "G5",
    "char": "黑",
    "words": [
      "黑板",
      "黑色",
      "黑暗",
      "黑夜"
    ]
  },
  {
    "level": "G5",
    "char": "讲",
    "words": [
      "讲话",
      "听讲",
      "讲究",
      "讲座"
    ]
  },
  {
    "level": "G5",
    "char": "卡",
    "words": [
      "信用卡",
      "银行卡",
      "贺卡",
      "磁卡"
    ]
  },
  {
    "level": "G5",
    "char": "刻",
    "words": [
      "立刻",
      "深刻",
      "时刻",
      "此刻"
    ]
  },
  {
    "level": "G5",
    "char": "轻",
    "words": [
      "年轻",
      "轻松",
      "轻易",
      "减轻"
    ]
  },
  {
    "level": "G5",
    "char": "司",
    "words": [
      "公司",
      "司机",
      "寿司",
      "打官司"
    ]
  },
  {
    "level": "G5",
    "char": "响",
    "words": [
      "影响",
      "反响",
      "影响力",
      "响声"
    ]
  },
  {
    "level": "G5",
    "char": "印",
    "words": [
      "打印",
      "复印",
      "印象",
      "印刷"
    ]
  },
  {
    "level": "G5",
    "char": "育",
    "words": [
      "教育",
      "体育",
      "体育场",
      "体育馆"
    ]
  },
  {
    "level": "G5",
    "char": "更",
    "words": [
      "更加",
      "更换",
      "更新",
      "变更"
    ]
  },
  {
    "level": "G5",
    "char": "划",
    "words": [
      "计划",
      "划船",
      "规划",
      "划分"
    ]
  },
  {
    "level": "G5",
    "char": "角",
    "words": [
      "角度",
      "角色",
      "主角",
      "角落"
    ]
  },
  {
    "level": "G5",
    "char": "克",
    "words": [
      "千克",
      "克服",
      "巧克力",
      "克隆"
    ]
  },
  {
    "level": "G5",
    "char": "练",
    "words": [
      "练习",
      "教练",
      "训练",
      "熟练"
    ]
  },
  {
    "level": "G5",
    "char": "卖",
    "words": [
      "外卖",
      "买卖",
      "出卖",
      "倒卖"
    ]
  },
  {
    "level": "G5",
    "char": "千",
    "words": [
      "千克",
      "千万",
      "成千上万",
      "千变万化"
    ]
  },
  {
    "level": "G5",
    "char": "堂",
    "words": [
      "课堂",
      "食堂",
      "教堂",
      "礼堂"
    ]
  },
  {
    "level": "G5",
    "char": "王",
    "words": [
      "老王",
      "小王",
      "国王",
      "王后"
    ]
  },
  {
    "level": "G5",
    "char": "油",
    "words": [
      "加油",
      "石油",
      "加油站",
      "汽油"
    ]
  },
  {
    "level": "G6",
    "char": "越",
    "words": [
      "越来越",
      "超越",
      "穿越",
      "跨越"
    ]
  },
  {
    "level": "G6",
    "char": "占",
    "words": [
      "占领",
      "占有",
      "占据",
      "霸占"
    ]
  },
  {
    "level": "G6",
    "char": "座",
    "words": [
      "座位",
      "讲座",
      "让座",
      "座谈会"
    ]
  },
  {
    "level": "G6",
    "char": "板",
    "words": [
      "黑板",
      "老板",
      "地板",
      "板块"
    ]
  },
  {
    "level": "G6",
    "char": "才",
    "words": [
      "刚才",
      "才能",
      "人才",
      "天才"
    ]
  },
  {
    "level": "G6",
    "char": "层",
    "words": [
      "层次",
      "层面",
      "高层",
      "层出不穷"
    ]
  },
  {
    "level": "G6",
    "char": "段",
    "words": [
      "阶段",
      "手段",
      "地段",
      "段落"
    ]
  },
  {
    "level": "G6",
    "char": "封",
    "words": [
      "信封",
      "封闭",
      "封顶",
      "封建"
    ]
  },
  {
    "level": "G6",
    "char": "凉",
    "words": [
      "凉快",
      "凉水",
      "凉鞋",
      "荒凉"
    ]
  },
  {
    "level": "G6",
    "char": "旅",
    "words": [
      "旅客",
      "旅行",
      "旅游",
      "旅馆"
    ]
  },
  {
    "level": "G6",
    "char": "绿",
    "words": [
      "绿色",
      "绿茶",
      "绿化",
      "碧绿"
    ]
  },
  {
    "level": "G6",
    "char": "因",
    "words": [
      "因为",
      "原因",
      "因此",
      "因而"
    ]
  },
  {
    "level": "G6",
    "char": "掉",
    "words": [
      "去掉",
      "掉队",
      "掉头",
      "丢掉"
    ]
  },
  {
    "level": "G6",
    "char": "检",
    "words": [
      "检查",
      "检测",
      "体检",
      "检验"
    ]
  },
  {
    "level": "G6",
    "char": "借",
    "words": [
      "借鉴",
      "借口",
      "借条",
      "借用"
    ]
  },
  {
    "level": "G6",
    "char": "拉",
    "words": [
      "拉开",
      "阿拉伯语",
      "拉动",
      "拉拢"
    ]
  },
  {
    "level": "G6",
    "char": "脸",
    "words": [
      "脸盆",
      "脸色",
      "笑脸",
      "愁眉苦脸"
    ]
  },
  {
    "level": "G6",
    "char": "碰",
    "words": [
      "碰到",
      "碰见",
      "碰钉子",
      "碰巧"
    ]
  },
  {
    "level": "G6",
    "char": "普",
    "words": [
      "普通",
      "普通话",
      "普遍",
      "普及"
    ]
  },
  {
    "level": "G6",
    "char": "青",
    "words": [
      "青年",
      "青少年",
      "青春",
      "青春期"
    ]
  },
  {
    "level": "G6",
    "char": "套",
    "words": [
      "手套",
      "套餐",
      "外套",
      "配套"
    ]
  },
  {
    "level": "G6",
    "char": "鞋",
    "words": [
      "球鞋",
      "高跟鞋",
      "皮鞋",
      "凉鞋"
    ]
  },
  {
    "level": "G6",
    "char": "已",
    "words": [
      "已经",
      "早已",
      "不得已",
      "不已"
    ]
  },
  {
    "level": "G6",
    "char": "英",
    "words": [
      "英文",
      "英语",
      "英勇",
      "英雄"
    ]
  },
  {
    "level": "G6",
    "char": "嘴",
    "words": [
      "嘴巴",
      "插嘴",
      "吵嘴",
      "咧嘴"
    ]
  },
  {
    "level": "G6",
    "char": "词",
    "words": [
      "词典",
      "词语",
      "生词",
      "词汇"
    ]
  },
  {
    "level": "G6",
    "char": "份",
    "words": [
      "月份",
      "身份证",
      "身份",
      "份额"
    ]
  },
  {
    "level": "G6",
    "char": "惯",
    "words": [
      "习惯",
      "惯例",
      "惯性",
      "娇惯"
    ]
  },
  {
    "level": "G6",
    "char": "忽",
    "words": [
      "忽然",
      "忽视",
      "忽略",
      "忽高忽低"
    ]
  },
  {
    "level": "G6",
    "char": "街",
    "words": [
      "街道",
      "大街",
      "街头",
      "大街小巷"
    ]
  },
  {
    "level": "G6",
    "char": "怕",
    "words": [
      "可怕",
      "害怕",
      "恐怕",
      "哪怕"
    ]
  },
  {
    "level": "G6",
    "char": "省",
    "words": [
      "节省",
      "省钱",
      "反省",
      "省略"
    ]
  },
  {
    "level": "G6",
    "char": "熟",
    "words": [
      "成熟",
      "熟人",
      "熟练",
      "熟悉"
    ]
  },
  {
    "level": "G6",
    "char": "阳",
    "words": [
      "太阳",
      "阳光",
      "阳台",
      "太阳能"
    ]
  },
  {
    "level": "G6",
    "char": "阴",
    "words": [
      "阴天",
      "阴谋",
      "阴影",
      "阴暗"
    ]
  },
  {
    "level": "G6",
    "char": "租",
    "words": [
      "出租",
      "出租车",
      "房租",
      "租金"
    ]
  },
  {
    "level": "G6",
    "char": "刚",
    "words": [
      "刚才",
      "刚刚",
      "刚好",
      "刚毅"
    ]
  },
  {
    "level": "G6",
    "char": "够",
    "words": [
      "不够",
      "能够",
      "足够",
      "够呛"
    ]
  },
  {
    "level": "G6",
    "char": "黄",
    "words": [
      "黄色",
      "黄瓜",
      "黄金",
      "黄昏"
    ]
  },
  {
    "level": "G6",
    "char": "或",
    "words": [
      "或者",
      "或许",
      "或是",
      "或多或少"
    ]
  },
  {
    "level": "G6",
    "char": "脚",
    "words": [
      "脚步",
      "脚印",
      "手脚",
      "指手画脚"
    ]
  },
  {
    "level": "G6",
    "char": "靠",
    "words": [
      "可靠",
      "依靠",
      "靠近",
      "靠拢"
    ]
  },
  {
    "level": "G6",
    "char": "蓝",
    "words": [
      "蓝色",
      "蓝领",
      "蓝天",
      "蓝图"
    ]
  },
  {
    "level": "G6",
    "char": "墙",
    "words": [
      "墙壁",
      "城墙",
      "防火墙",
      "围墙"
    ]
  },
  {
    "level": "G6",
    "char": "让",
    "words": [
      "转让",
      "让座",
      "让步",
      "退让"
    ]
  },
  {
    "level": "G6",
    "char": "铁",
    "words": [
      "地铁",
      "地铁站",
      "铁路",
      "高铁"
    ]
  },
  {
    "level": "G6",
    "char": "银",
    "words": [
      "银行",
      "银行卡",
      "银牌",
      "银幕"
    ]
  },
  {
    "level": "G6",
    "char": "迎",
    "words": [
      "欢迎",
      "迎接",
      "迎来",
      "迎合"
    ]
  },
  {
    "level": "G6",
    "char": "钟",
    "words": [
      "分钟",
      "闹钟",
      "钟头",
      "警钟"
    ]
  },
  {
    "level": "G6",
    "char": "遍",
    "words": [
      "普遍",
      "遍地",
      "遍布"
    ]
  },
  {
    "level": "G6",
    "char": "吹",
    "words": [
      "吹了",
      "吹牛",
      "吹捧"
    ]
  },
  {
    "level": "G6",
    "char": "但",
    "words": [
      "不但",
      "但是",
      "但愿"
    ]
  },
  {
    "level": "G6",
    "char": "己",
    "words": [
      "自己",
      "身不由己",
      "损人利己",
      "知己"
    ]
  },
  {
    "level": "G6",
    "char": "际",
    "words": [
      "国际",
      "实际",
      "实际上",
      "交际"
    ]
  },
  {
    "level": "G6",
    "char": "末",
    "words": [
      "周末",
      "期末",
      "末日"
    ]
  },
  {
    "level": "G6",
    "char": "弄",
    "words": [
      "嘲弄",
      "卖弄",
      "弄虚作假"
    ]
  },
  {
    "level": "G6",
    "char": "瓶",
    "words": [
      "瓶子",
      "花瓶",
      "瓶颈"
    ]
  },
  {
    "level": "G6",
    "char": "且",
    "words": [
      "而且",
      "并且",
      "况且"
    ]
  },
  {
    "level": "G6",
    "char": "疼",
    "words": [
      "心疼",
      "疼痛",
      "头疼"
    ]
  },
  {
    "level": "G6",
    "char": "姓",
    "words": [
      "姓名",
      "老百姓",
      "姓氏"
    ]
  },
  {
    "level": "G6",
    "char": "宜",
    "words": [
      "便宜",
      "不宜",
      "事宜",
      "适宜"
    ]
  },
  {
    "level": "G6",
    "char": "永",
    "words": [
      "永远",
      "永不",
      "永恒",
      "永久"
    ]
  },
  {
    "level": "G6",
    "char": "脏",
    "words": [
      "心脏",
      "心脏病",
      "肝脏"
    ]
  },
  {
    "level": "G6",
    "char": "纸",
    "words": [
      "报纸",
      "图纸",
      "造纸术"
    ]
  },
  {
    "level": "G6",
    "char": "饱",
    "words": [
      "饱和",
      "饱满"
    ]
  },
  {
    "level": "G6",
    "char": "晨",
    "words": [
      "早晨",
      "清晨",
      "凌晨"
    ]
  },
  {
    "level": "G6",
    "char": "懂",
    "words": [
      "懂得",
      "懂事"
    ]
  },
  {
    "level": "G6",
    "char": "该",
    "words": [
      "应该",
      "活该"
    ]
  },
  {
    "level": "G6",
    "char": "睛",
    "words": [
      "眼睛",
      "画龙点睛",
      "目不转睛"
    ]
  },
  {
    "level": "G6",
    "char": "句",
    "words": [
      "句子",
      "一句话"
    ]
  },
  {
    "level": "G6",
    "char": "哭",
    "words": [
      "哭泣",
      "哭笑不得"
    ]
  },
  {
    "level": "G6",
    "char": "爬",
    "words": [
      "爬山",
      "连滚带爬"
    ]
  },
  {
    "level": "G6",
    "char": "晴",
    "words": [
      "晴天",
      "晴朗"
    ]
  },
  {
    "level": "G6",
    "char": "舒",
    "words": [
      "舒服",
      "舒适",
      "舒畅"
    ]
  }
];

export const HSK_WORDS_BY_CHAR: Readonly<Record<string, readonly string[]>> = {
  "一": [
    "一半",
    "一会儿",
    "一块儿",
    "一下儿"
  ],
  "二": [
    "第二",
    "二手",
    "二维码",
    "独一无二"
  ],
  "三": [
    "再三",
    "三明治",
    "接二连三",
    "举一反三"
  ],
  "四": [
    "四周",
    "四处",
    "四合院",
    "四季"
  ],
  "五": [
    "五颜六色",
    "三番五次",
    "五花八门",
    "五星级"
  ],
  "六": [
    "六个",
    "六岁"
  ],
  "七": [
    "横七竖八",
    "乱七八糟",
    "七嘴八舌"
  ],
  "八": [
    "八卦",
    "横七竖八",
    "乱七八糟",
    "七嘴八舌"
  ],
  "九": [
    "九个",
    "九月"
  ],
  "十": [
    "十分",
    "十足",
    "十字路口"
  ],
  "人": [
    "别人",
    "病人",
    "工人",
    "家人"
  ],
  "口": [
    "路口",
    "门口",
    "出口",
    "人口"
  ],
  "日": [
    "日期",
    "生日",
    "星期日",
    "节日"
  ],
  "月": [
    "月份",
    "月亮",
    "上个月",
    "下个月"
  ],
  "水": [
    "水果",
    "水平",
    "药水",
    "凉水"
  ],
  "火": [
    "火车",
    "着火",
    "火柴",
    "火腿"
  ],
  "山": [
    "爬山",
    "登山",
    "山区",
    "山峰"
  ],
  "木": [
    "木头",
    "麻木",
    "木板",
    "木材"
  ],
  "田": [
    "田野",
    "农田"
  ],
  "土": [
    "土地",
    "土豆",
    "本土",
    "出土"
  ],
  "上": [
    "车上",
    "地上",
    "关上",
    "楼上"
  ],
  "下": [
    "楼下",
    "下班",
    "下边",
    "下车"
  ],
  "左": [
    "左边",
    "左右",
    "左顾右盼"
  ],
  "右": [
    "右边",
    "左右",
    "左顾右盼",
    "座右铭"
  ],
  "大": [
    "不大",
    "大学",
    "大学生",
    "大部分"
  ],
  "小": [
    "小孩儿",
    "小姐",
    "小朋友",
    "小时"
  ],
  "多": [
    "多少",
    "差不多",
    "大多数",
    "多久"
  ],
  "少": [
    "多少",
    "不少",
    "青少年",
    "少数"
  ],
  "中": [
    "中国",
    "中间",
    "中文",
    "中午"
  ],
  "天": [
    "白天",
    "半天",
    "后天",
    "今天"
  ],
  "云": [
    "多云",
    "乌云",
    "风云"
  ],
  "风": [
    "一路顺风",
    "风险",
    "风格",
    "风景"
  ],
  "雨": [
    "下雨",
    "雨水",
    "暴风雨",
    "暴雨"
  ],
  "雪": [
    "下雪",
    "冰雪",
    "滑雪",
    "瑞雪"
  ],
  "花": [
    "花园",
    "开花",
    "鲜花",
    "桃花"
  ],
  "草": [
    "草地",
    "草原",
    "草案",
    "草坪"
  ],
  "虫": [
    "虫子",
    "害虫",
    "昆虫"
  ],
  "鱼": [
    "钓鱼",
    "鳄鱼",
    "鲨鱼"
  ],
  "鸟": [
    "小鸟",
    "鸟儿"
  ],
  "马": [
    "马路",
    "马上",
    "马车",
    "黑马"
  ],
  "牛": [
    "牛奶",
    "牛仔裤",
    "奶牛",
    "吹牛"
  ],
  "羊": [
    "山羊",
    "羊毛"
  ],
  "手": [
    "手机",
    "洗手间",
    "举手",
    "手表"
  ],
  "足": [
    "满足",
    "足够",
    "足球",
    "不足"
  ],
  "耳": [
    "耳机",
    "耳朵",
    "刺耳",
    "耳光"
  ],
  "目": [
    "节目",
    "目的",
    "目标",
    "目前"
  ],
  "牙": [
    "刷牙",
    "牙刷",
    "西班牙语",
    "牙齿"
  ],
  "门": [
    "门口",
    "门票",
    "出门",
    "大门"
  ],
  "车": [
    "车票",
    "车上",
    "车站",
    "打车"
  ],
  "船": [
    "划船",
    "轮船",
    "船员",
    "船长"
  ],
  "家": [
    "国家",
    "回家",
    "家里",
    "家人"
  ],
  "学": [
    "大学",
    "大学生",
    "放学",
    "教学楼"
  ],
  "校": [
    "学校",
    "校园",
    "校长",
    "夜校"
  ],
  "春": [
    "春节",
    "春天",
    "春季",
    "青春"
  ],
  "夏": [
    "夏天",
    "夏季",
    "夏令营"
  ],
  "秋": [
    "秋天",
    "秋季",
    "中秋节"
  ],
  "冬": [
    "冬天",
    "冬季"
  ],
  "东": [
    "东边",
    "东西",
    "东北",
    "东方"
  ],
  "西": [
    "东西",
    "西边",
    "西北",
    "西餐"
  ],
  "南": [
    "南边",
    "东南",
    "南方",
    "西南"
  ],
  "北": [
    "北边",
    "北京",
    "北方",
    "东北"
  ],
  "前": [
    "前边",
    "前天",
    "面前",
    "前年"
  ],
  "后": [
    "后边",
    "后天",
    "最后",
    "后来"
  ],
  "里": [
    "家里",
    "里边",
    "哪里",
    "那里"
  ],
  "外": [
    "国外",
    "外边",
    "外国",
    "外语"
  ],
  "早": [
    "早饭",
    "早上",
    "早餐",
    "早晨"
  ],
  "晚": [
    "晚饭",
    "晚上",
    "晚安",
    "晚报"
  ],
  "明": [
    "明白",
    "明年",
    "明天",
    "明星"
  ],
  "亮": [
    "漂亮",
    "月亮",
    "明亮",
    "洪亮"
  ],
  "声": [
    "大声",
    "声音",
    "小声",
    "歌声"
  ],
  "音": [
    "读音",
    "声音",
    "音节",
    "音乐"
  ],
  "朋": [
    "朋友们",
    "男朋友",
    "女朋友",
    "朋友"
  ],
  "友": [
    "朋友们",
    "男朋友",
    "女朋友",
    "朋友"
  ],
  "老": [
    "老人",
    "老师",
    "老王",
    "老年"
  ],
  "师": [
    "老师",
    "教师",
    "工程师",
    "律师"
  ],
  "同": [
    "同学",
    "不同",
    "同时",
    "同事"
  ],
  "书": [
    "读书",
    "书包",
    "书店",
    "图书馆"
  ],
  "笔": [
    "笔记",
    "笔记本",
    "钢笔",
    "毛笔"
  ],
  "国": [
    "国家",
    "国外",
    "外国",
    "中国"
  ],
  "城": [
    "长城",
    "城市",
    "城里",
    "城区"
  ],
  "村": [
    "农村",
    "乡村",
    "村庄"
  ],
  "河": [
    "河流",
    "河畔",
    "运河"
  ],
  "海": [
    "大海",
    "海边",
    "海关",
    "海水"
  ],
  "森": [
    "森林",
    "阴森"
  ],
  "林": [
    "森林",
    "树林",
    "园林",
    "丛林"
  ],
  "星": [
    "星期",
    "星期日",
    "星期天",
    "明星"
  ],
  "光": [
    "不光",
    "光明",
    "阳光",
    "灯光"
  ],
  "电": [
    "打电话",
    "电话",
    "电脑",
    "电视"
  ],
  "气": [
    "不客气",
    "生气",
    "天气",
    "空气"
  ],
  "快": [
    "快餐",
    "快点儿",
    "快乐",
    "快要"
  ],
  "乐": [
    "快乐",
    "音乐",
    "音乐会",
    "欢乐"
  ],
  "安": [
    "安静",
    "安全",
    "平安",
    "晚安"
  ],
  "静": [
    "安静",
    "冷静",
    "宁静",
    "平静"
  ],
  "勇": [
    "英勇",
    "勇敢",
    "勇气",
    "奋勇"
  ],
  "敢": [
    "勇敢",
    "不敢当",
    "敢于",
    "敢情"
  ],
  "帮": [
    "帮忙",
    "帮助",
    "帮手"
  ],
  "助": [
    "帮助",
    "赞助",
    "辅助",
    "助理"
  ],
  "习": [
    "学习",
    "复习",
    "练习",
    "实习"
  ],
  "语": [
    "汉语",
    "外语",
    "词语",
    "英语"
  ],
  "言": [
    "语言",
    "发言",
    "言语",
    "传言"
  ],
  "身": [
    "身上",
    "身体",
    "全身",
    "身边"
  ],
  "体": [
    "身体",
    "全体",
    "体育",
    "体育场"
  ],
  "健": [
    "健康",
    "健身",
    "健全",
    "保健"
  ],
  "康": [
    "健康",
    "康复",
    "小康"
  ],
  "运": [
    "运动",
    "命运",
    "幸运",
    "运输"
  ],
  "动": [
    "动作",
    "动物",
    "动物园",
    "感动"
  ],
  "比": [
    "比如",
    "比如说",
    "比较",
    "比例"
  ],
  "赛": [
    "比赛",
    "决赛",
    "大奖赛",
    "竞赛"
  ],
  "故": [
    "故事",
    "故意",
    "故乡",
    "事故"
  ],
  "事": [
    "没事儿",
    "故事",
    "好事",
    "事情"
  ],
  "颜": [
    "颜色",
    "五颜六色",
    "容颜"
  ],
  "色": [
    "白色",
    "黑色",
    "红色",
    "黄色"
  ],
  "形": [
    "形成",
    "形式",
    "形象",
    "形状"
  ],
  "状": [
    "形状",
    "状况",
    "状态",
    "现状"
  ],
  "方": [
    "地方",
    "北方",
    "东方",
    "方便"
  ],
  "向": [
    "方向",
    "向导",
    "向前",
    "向上"
  ],
  "时": [
    "时候",
    "时间",
    "小时",
    "有时候"
  ],
  "间": [
    "房间",
    "时间",
    "洗手间",
    "中间"
  ],
  "节": [
    "春节",
    "节目",
    "节日",
    "音节"
  ],
  "祖": [
    "祖父",
    "祖国",
    "祖母",
    "祖传"
  ],
  "先": [
    "先生",
    "领先",
    "首先",
    "先进"
  ],
  "观": [
    "参观",
    "观点",
    "观察",
    "观看"
  ],
  "察": [
    "观察",
    "警察",
    "考察",
    "察觉"
  ],
  "想": [
    "理想",
    "想到",
    "想法",
    "想起"
  ],
  "象": [
    "对象",
    "现象",
    "形象",
    "印象"
  ],
  "发": [
    "出发",
    "发现",
    "头发",
    "发表"
  ],
  "现": [
    "现在",
    "出现",
    "发现",
    "实现"
  ],
  "创": [
    "创新",
    "创业",
    "创造",
    "创作"
  ],
  "造": [
    "创造",
    "改造",
    "造成",
    "制造"
  ],
  "保": [
    "保安",
    "保持",
    "保存",
    "保护"
  ],
  "护": [
    "护照",
    "保护",
    "爱护",
    "护士"
  ],
  "环": [
    "环保",
    "环境",
    "环节",
    "循环"
  ],
  "境": [
    "环境",
    "边境",
    "出境",
    "处境"
  ],
  "责": [
    "负责",
    "责任",
    "负责人",
    "指责"
  ],
  "任": [
    "任何",
    "任务",
    "信任",
    "责任"
  ],
  "合": [
    "合适",
    "场合",
    "合法",
    "合格"
  ],
  "作": [
    "动作",
    "工作",
    "叫作",
    "作家"
  ],
  "坚": [
    "坚持",
    "坚决",
    "坚强",
    "坚固"
  ],
  "持": [
    "保持",
    "持续",
    "坚持",
    "支持"
  ],
  "希": [
    "希望",
    "希求"
  ],
  "望": [
    "希望",
    "愿望",
    "看望",
    "失望"
  ],
  "梦": [
    "梦见",
    "梦想",
    "做梦",
    "梦幻"
  ],
  "愿": [
    "愿意",
    "愿望",
    "志愿者",
    "志愿"
  ],
  "世": [
    "去世",
    "世纪",
    "世界",
    "世界杯"
  ],
  "界": [
    "世界",
    "世界杯",
    "全世界",
    "外界"
  ],
  "未": [
    "未必",
    "未来",
    "从未",
    "前所未有"
  ],
  "来": [
    "出来",
    "回来",
    "进来",
    "来到"
  ],
  "不": [
    "不大",
    "不对",
    "不客气",
    "不用"
  ],
  "子": [
    "包子",
    "杯子",
    "本子",
    "儿子"
  ],
  "出": [
    "出来",
    "出去",
    "出发",
    "出国"
  ],
  "有": [
    "还有",
    "没有",
    "有的",
    "有名"
  ],
  "生": [
    "大学生",
    "男生",
    "女生",
    "生病"
  ],
  "地": [
    "地点",
    "地方",
    "地上",
    "地图"
  ],
  "儿": [
    "儿子",
    "好玩儿",
    "没事儿",
    "面条儿"
  ],
  "开": [
    "打开",
    "开车",
    "开会",
    "开玩笑"
  ],
  "面": [
    "见面",
    "面包",
    "面条儿",
    "对面"
  ],
  "得": [
    "得到",
    "记得",
    "觉得",
    "得出"
  ],
  "分": [
    "部分",
    "大部分",
    "分开",
    "分数"
  ],
  "好": [
    "爱好",
    "好吃",
    "好看",
    "好听"
  ],
  "行": [
    "不行",
    "进行",
    "举行",
    "流行"
  ],
  "会": [
    "开会",
    "一会儿",
    "不一会儿",
    "机会"
  ],
  "说": [
    "说话",
    "比如说",
    "说明",
    "听说"
  ],
  "用": [
    "不用",
    "有用",
    "常用",
    "使用"
  ],
  "高": [
    "高兴",
    "高级",
    "高中",
    "提高"
  ],
  "过": [
    "不过",
    "超过",
    "过来",
    "过年"
  ],
  "机": [
    "电视机",
    "飞机",
    "机场",
    "机票"
  ],
  "到": [
    "得到",
    "回到",
    "看到",
    "来到"
  ],
  "年": [
    "半年",
    "今年",
    "明年",
    "去年"
  ],
  "重": [
    "重要",
    "重复",
    "重新",
    "重点"
  ],
  "打": [
    "打车",
    "打电话",
    "打开",
    "打球"
  ],
  "期": [
    "日期",
    "星期",
    "星期日",
    "星期天"
  ],
  "起": [
    "对不起",
    "起床",
    "起来",
    "一起"
  ],
  "点": [
    "地点",
    "一点儿",
    "点头",
    "观点"
  ],
  "场": [
    "机场",
    "商场",
    "广场",
    "球场"
  ],
  "路": [
    "路口",
    "路上",
    "马路",
    "走路"
  ],
  "见": [
    "见面",
    "看见",
    "听见",
    "再见"
  ],
  "名": [
    "名字",
    "有名",
    "报名",
    "名称"
  ],
  "道": [
    "知道",
    "道理",
    "道路",
    "味道"
  ],
  "工": [
    "工人",
    "工作",
    "打工",
    "工厂"
  ],
  "对": [
    "不对",
    "对不起",
    "对话",
    "对面"
  ],
  "看": [
    "好看",
    "看病",
    "看到",
    "看见"
  ],
  "能": [
    "可能",
    "能够",
    "只能",
    "才能"
  ],
  "着": [
    "接着",
    "睡着",
    "着火",
    "着急"
  ],
  "难": [
    "难过",
    "难看",
    "难受",
    "难题"
  ],
  "是": [
    "还是",
    "是不是",
    "但是",
    "可是"
  ],
  "本": [
    "本子",
    "课本",
    "笔记本",
    "本来"
  ],
  "边": [
    "北边",
    "东边",
    "后边",
    "里边"
  ],
  "话": [
    "打电话",
    "电话",
    "说话",
    "的话"
  ],
  "回": [
    "回答",
    "回到",
    "回家",
    "回来"
  ],
  "关": [
    "关上",
    "没关系",
    "关机",
    "关心"
  ],
  "进": [
    "进来",
    "进去",
    "请进",
    "进入"
  ],
  "新": [
    "新年",
    "重新",
    "新闻",
    "创新"
  ],
  "要": [
    "重要",
    "不要",
    "就要",
    "快要"
  ],
  "放": [
    "放假",
    "放学",
    "放下",
    "放心"
  ],
  "文": [
    "课文",
    "中文",
    "英文",
    "作文"
  ],
  "正": [
    "正在",
    "真正",
    "正常",
    "正好"
  ],
  "别": [
    "别的",
    "别人",
    "特别",
    "分别"
  ],
  "教": [
    "教学楼",
    "教师",
    "教室",
    "教学"
  ],
  "热": [
    "热情",
    "热爱",
    "热烈",
    "热闹"
  ],
  "视": [
    "电视",
    "电视机",
    "重视",
    "电视剧"
  ],
  "常": [
    "常常",
    "非常",
    "常见",
    "常用"
  ],
  "球": [
    "打球",
    "地球",
    "篮球",
    "排球"
  ],
  "知": [
    "知道",
    "知识",
    "通知",
    "通知书"
  ],
  "病": [
    "病人",
    "看病",
    "生病",
    "毛病"
  ],
  "从": [
    "从小",
    "从来",
    "从前",
    "从事"
  ],
  "假": [
    "放假",
    "请假",
    "假期",
    "休假"
  ],
  "了": [
    "除了",
    "极了",
    "为了",
    "了不起"
  ],
  "样": [
    "一样",
    "那样",
    "什么样",
    "同样"
  ],
  "干": [
    "干净",
    "干什么",
    "干杯",
    "干活儿"
  ],
  "就": [
    "就要",
    "早就",
    "成就",
    "就是"
  ],
  "去": [
    "出去",
    "回去",
    "进去",
    "去年"
  ],
  "笑": [
    "开玩笑",
    "笑话",
    "笑话儿",
    "微笑"
  ],
  "在": [
    "现在",
    "在家",
    "正在",
    "实在"
  ],
  "真": [
    "认真",
    "真的",
    "真正",
    "真实"
  ],
  "字": [
    "汉字",
    "名字",
    "数字",
    "字典"
  ],
  "服": [
    "衣服",
    "服务",
    "舒服",
    "服装"
  ],
  "告": [
    "告诉",
    "广告",
    "报告",
    "告别"
  ],
  "客": [
    "不客气",
    "顾客",
    "客人",
    "旅客"
  ],
  "女": [
    "女儿",
    "女孩儿",
    "女朋友",
    "女人"
  ],
  "爱": [
    "爱好",
    "爱情",
    "爱人",
    "可爱"
  ],
  "歌": [
    "唱歌",
    "歌迷",
    "歌声",
    "歌手"
  ],
  "号": [
    "信号",
    "符号",
    "号码",
    "括号"
  ],
  "没": [
    "没关系",
    "没什么",
    "没事儿",
    "没有"
  ],
  "商": [
    "商场",
    "商店",
    "商量",
    "商人"
  ],
  "包": [
    "包子",
    "面包",
    "钱包",
    "书包"
  ],
  "次": [
    "上次",
    "下次",
    "其次",
    "多次"
  ],
  "和": [
    "和平",
    "暖和",
    "温和",
    "和谐"
  ],
  "记": [
    "记得",
    "记住",
    "忘记",
    "笔记"
  ],
  "听": [
    "好听",
    "听到",
    "听见",
    "听写"
  ],
  "问": [
    "请问",
    "问路",
    "问题",
    "访问"
  ],
  "果": [
    "水果",
    "结果",
    "如果",
    "成果"
  ],
  "试": [
    "考试",
    "试题",
    "试验",
    "测试"
  ],
  "影": [
    "电影",
    "电影院",
    "影片",
    "影响"
  ],
  "远": [
    "永远",
    "跳远",
    "远处",
    "长远"
  ],
  "白": [
    "白天",
    "明白",
    "白色",
    "白菜"
  ],
  "觉": [
    "觉得",
    "睡觉",
    "感觉",
    "自觉"
  ],
  "认": [
    "认识",
    "认真",
    "认为",
    "否认"
  ],
  "图": [
    "地图",
    "图书馆",
    "图片",
    "图画"
  ],
  "走": [
    "走路",
    "走过",
    "走进",
    "走开"
  ],
  "半": [
    "半年",
    "半天",
    "一半",
    "半夜"
  ],
  "备": [
    "准备",
    "设备",
    "具备",
    "配备"
  ],
  "差": [
    "差不多",
    "差别",
    "差距",
    "差点儿"
  ],
  "房": [
    "房间",
    "房子",
    "住房",
    "房东"
  ],
  "冷": [
    "寒冷",
    "冷静",
    "冷气",
    "冷水"
  ],
  "票": [
    "车票",
    "机票",
    "门票",
    "票价"
  ],
  "钱": [
    "钱包",
    "价钱",
    "挣钱",
    "金钱"
  ],
  "树": [
    "树林",
    "树叶",
    "松树",
    "桃树"
  ],
  "条": [
    "面条儿",
    "条件",
    "便条",
    "薯条"
  ],
  "喜": [
    "喜欢",
    "喜爱",
    "喜剧",
    "惊喜"
  ],
  "的": [
    "别的",
    "有的",
    "真的",
    "的话"
  ],
  "考": [
    "考试",
    "考生",
    "考验",
    "参考"
  ],
  "识": [
    "认识",
    "知识",
    "常识",
    "意识"
  ],
  "网": [
    "上网",
    "网上",
    "网友",
    "网球"
  ],
  "住": [
    "记住",
    "站住",
    "住房",
    "住院"
  ],
  "班": [
    "上班",
    "下班",
    "班长",
    "班级"
  ],
  "饭": [
    "吃饭",
    "饭店",
    "米饭",
    "晚饭"
  ],
  "非": [
    "非常",
    "除非",
    "并非",
    "非金属"
  ],
  "个": [
    "个子",
    "个人",
    "个性",
    "整个"
  ],
  "候": [
    "时候",
    "有时候",
    "那时候",
    "小时候"
  ],
  "么": [
    "干什么",
    "没什么",
    "什么",
    "怎么"
  ],
  "请": [
    "请假",
    "请进",
    "请问",
    "请坐"
  ],
  "兴": [
    "高兴",
    "感兴趣",
    "兴奋",
    "兴趣"
  ],
  "衣": [
    "衣服",
    "大衣",
    "洗衣机",
    "衬衣"
  ],
  "准": [
    "准备",
    "准确",
    "标准",
    "批准"
  ],
  "错": [
    "不错",
    "错误",
    "没错",
    "错过"
  ],
  "课": [
    "课本",
    "课文",
    "上课",
    "下课"
  ],
  "楼": [
    "教学楼",
    "楼上",
    "楼下",
    "大楼"
  ],
  "息": [
    "休息",
    "信息",
    "消息",
    "利息"
  ],
  "院": [
    "电影院",
    "学院",
    "医院",
    "出院"
  ],
  "吃": [
    "吃饭",
    "好吃",
    "吃惊",
    "小吃"
  ],
  "等": [
    "等到",
    "等于",
    "平等",
    "等待"
  ],
  "馆": [
    "图书馆",
    "饭馆",
    "体育馆",
    "大使馆"
  ],
  "欢": [
    "喜欢",
    "欢迎",
    "欢乐",
    "悲欢离合"
  ],
  "送": [
    "送到",
    "送给",
    "发送",
    "赠送"
  ],
  "写": [
    "听写",
    "写作",
    "抄写",
    "描写"
  ],
  "这": [
    "这边",
    "这里",
    "这儿",
    "这些"
  ],
  "读": [
    "读书",
    "读音",
    "读者",
    "阅读"
  ],
  "飞": [
    "飞机",
    "起飞",
    "飞行",
    "飞船"
  ],
  "贵": [
    "宝贵",
    "珍贵",
    "昂贵",
    "高贵"
  ],
  "今": [
    "今年",
    "今天",
    "今后",
    "至今"
  ],
  "忙": [
    "帮忙",
    "连忙",
    "急忙",
    "慌忙"
  ],
  "那": [
    "那边",
    "那里",
    "那儿",
    "那些"
  ],
  "太": [
    "不太",
    "太太",
    "太阳",
    "老太太"
  ],
  "元": [
    "单元",
    "美元",
    "公元",
    "元旦"
  ],
  "再": [
    "再见",
    "一再",
    "再三",
    "再次"
  ],
  "店": [
    "饭店",
    "商店",
    "书店",
    "酒店"
  ],
  "跑": [
    "跑步",
    "逃跑",
    "奔跑",
    "长跑"
  ],
  "玩": [
    "好玩儿",
    "开玩笑",
    "玩儿",
    "玩具"
  ],
  "休": [
    "休息",
    "休假",
    "退休",
    "休闲"
  ],
  "医": [
    "医生",
    "医院",
    "西医",
    "中医"
  ],
  "还": [
    "还是",
    "还有",
    "偿还",
    "返还"
  ],
  "坏": [
    "坏处",
    "坏人",
    "破坏",
    "好坏"
  ],
  "毛": [
    "毛病",
    "毛巾",
    "毛衣",
    "毛笔"
  ],
  "们": [
    "朋友们",
    "你们",
    "他们",
    "她们"
  ],
  "男": [
    "男孩儿",
    "男朋友",
    "男人",
    "男生"
  ],
  "脑": [
    "电脑",
    "头脑",
    "脑袋",
    "大脑"
  ],
  "洗": [
    "洗手间",
    "洗衣机",
    "洗澡",
    "清洗"
  ],
  "站": [
    "车站",
    "地铁站",
    "网站",
    "站住"
  ],
  "做": [
    "做到",
    "做法",
    "做饭",
    "做客"
  ],
  "百": [
    "老百姓",
    "百货",
    "百分点",
    "百分比"
  ],
  "唱": [
    "唱歌",
    "演唱",
    "演唱会",
    "唱片"
  ],
  "答": [
    "回答",
    "答应",
    "答案",
    "报答"
  ],
  "两": [
    "两边",
    "两岸",
    "两侧",
    "两手"
  ],
  "零": [
    "零下",
    "零食",
    "孤零零",
    "零花钱"
  ],
  "慢": [
    "慢慢",
    "慢车",
    "傲慢",
    "怠慢"
  ],
  "米": [
    "米饭",
    "毫米",
    "厘米",
    "玉米"
  ],
  "诉": [
    "告诉",
    "投诉",
    "起诉",
    "倾诉"
  ],
  "忘": [
    "忘记",
    "难忘",
    "废寝忘食",
    "念念不忘"
  ],
  "系": [
    "没关系",
    "关系",
    "联系",
    "系列"
  ],
  "茶": [
    "红茶",
    "绿茶",
    "奶茶",
    "茶叶"
  ],
  "穿": [
    "穿上",
    "穿过",
    "穿小鞋",
    "穿越"
  ],
  "给": [
    "交给",
    "送给",
    "递给",
    "供给"
  ],
  "跟": [
    "高跟鞋",
    "跟前",
    "跟随",
    "跟不上"
  ],
  "奶": [
    "奶奶",
    "牛奶",
    "奶茶",
    "酸奶"
  ],
  "睡": [
    "睡觉",
    "午睡",
    "睡着",
    "睡眠"
  ],
  "午": [
    "上午",
    "午饭",
    "下午",
    "中午"
  ],
  "些": [
    "哪些",
    "那些",
    "一些",
    "有些"
  ],
  "最": [
    "最好",
    "最后",
    "最近",
    "最初"
  ],
  "蛋": [
    "鸡蛋",
    "蛋糕",
    "笨蛋",
    "蛋白质"
  ],
  "弟": [
    "弟弟",
    "兄弟",
    "徒弟",
    "弟子"
  ],
  "都": [
    "首都",
    "大都",
    "全都",
    "都市"
  ],
  "介": [
    "介绍",
    "中介",
    "简介",
    "介入"
  ],
  "净": [
    "干净",
    "纯净水",
    "洁净",
    "净化"
  ],
  "累": [
    "积累",
    "劳累",
    "累积",
    "累计"
  ],
  "拿": [
    "拿出",
    "拿到",
    "拿走",
    "拿手"
  ],
  "哪": [
    "哪里",
    "哪儿",
    "哪些",
    "哪怕"
  ],
  "怎": [
    "怎么",
    "怎么办",
    "怎么样",
    "怎样"
  ],
  "杯": [
    "杯子",
    "干杯",
    "世界杯",
    "奖杯"
  ],
  "菜": [
    "菜单",
    "白菜",
    "蔬菜",
    "菜市场"
  ],
  "床": [
    "起床",
    "病床",
    "床位",
    "临床"
  ],
  "鸡": [
    "鸡蛋",
    "公鸡",
    "母鸡",
    "鹤立鸡群"
  ],
  "姐": [
    "姐姐",
    "小姐",
    "大姐",
    "姐妹"
  ],
  "买": [
    "购买",
    "买卖",
    "买不起",
    "收买"
  ],
  "旁": [
    "旁边",
    "旁观",
    "袖手旁观",
    "一旁"
  ],
  "什": [
    "干什么",
    "没什么",
    "什么",
    "什么样"
  ],
  "他": [
    "他们",
    "其他",
    "吉他",
    "他人"
  ],
  "也": [
    "也许",
    "也好",
    "再也",
    "也就是说"
  ],
  "找": [
    "找到",
    "找出",
    "寻找",
    "查找"
  ],
  "坐": [
    "请坐",
    "坐下",
    "乘坐",
    "坐落"
  ],
  "第": [
    "第二",
    "第一手",
    "第一线"
  ],
  "哥": [
    "哥哥",
    "大哥",
    "帅哥"
  ],
  "孩": [
    "孩子",
    "男孩儿",
    "女孩儿",
    "小孩儿"
  ],
  "几": [
    "几乎",
    "几率",
    "寥寥无几"
  ],
  "叫": [
    "叫作",
    "叫板",
    "叫好"
  ],
  "汽": [
    "汽车",
    "公共汽车",
    "汽水",
    "汽油"
  ],
  "吧": [
    "酒吧",
    "网吧"
  ],
  "饿": [
    "饥饿",
    "忍饥挨饿"
  ],
  "汉": [
    "汉语",
    "汉字",
    "老汉"
  ],
  "喝": [
    "吃喝玩乐",
    "喝彩"
  ],
  "块": [
    "一块儿",
    "板块"
  ],
  "妈": [
    "妈妈",
    "大妈"
  ],
  "妹": [
    "妹妹",
    "姐妹"
  ],
  "肉": [
    "肌肉",
    "烤肉"
  ],
  "岁": [
    "岁月",
    "岁数"
  ],
  "我": [
    "我们",
    "自我"
  ],
  "谢": [
    "谢谢",
    "感谢",
    "新陈代谢"
  ],
  "爷": [
    "爷爷",
    "大爷",
    "姥爷"
  ],
  "页": [
    "网页",
    "主页"
  ],
  "桌": [
    "桌子",
    "书桌",
    "餐桌"
  ],
  "京": [
    "北京",
    "京剧"
  ],
  "心": [
    "放心",
    "关心",
    "开心",
    "小心"
  ],
  "头": [
    "点头",
    "里头",
    "头发",
    "老头儿"
  ],
  "力": [
    "努力",
    "动力",
    "力量",
    "能力"
  ],
  "意": [
    "不好意思",
    "故意",
    "满意",
    "意见"
  ],
  "成": [
    "变成",
    "成绩",
    "成为",
    "完成"
  ],
  "自": [
    "大自然",
    "来自",
    "自己",
    "自行车"
  ],
  "公": [
    "办公室",
    "公共汽车",
    "公交车",
    "公斤"
  ],
  "长": [
    "班长",
    "队长",
    "家长",
    "市长"
  ],
  "理": [
    "道理",
    "经理",
    "理想",
    "办理"
  ],
  "定": [
    "不一定",
    "一定",
    "定期",
    "否定"
  ],
  "实": [
    "实际",
    "实习",
    "实现",
    "实在"
  ],
  "情": [
    "爱情",
    "热情",
    "事情",
    "心情"
  ],
  "相": [
    "相同",
    "相信",
    "相机",
    "照相"
  ],
  "于": [
    "等于",
    "属于",
    "由于",
    "终于"
  ],
  "可": [
    "可爱",
    "可能",
    "可怕",
    "可是"
  ],
  "主": [
    "主人",
    "主要",
    "主持",
    "主动"
  ],
  "当": [
    "当时",
    "当初",
    "当地",
    "当然"
  ],
  "通": [
    "交通",
    "普通",
    "普通话",
    "通过"
  ],
  "然": [
    "大自然",
    "忽然",
    "然后",
    "虽然"
  ],
  "交": [
    "公交车",
    "交给",
    "交朋友",
    "交通"
  ],
  "度": [
    "角度",
    "态度",
    "温度",
    "程度"
  ],
  "为": [
    "成为",
    "认为",
    "为什么",
    "行为"
  ],
  "信": [
    "短信",
    "相信",
    "信号",
    "信息"
  ],
  "处": [
    "到处",
    "好处",
    "坏处",
    "长处"
  ],
  "收": [
    "收到",
    "收入",
    "收费",
    "收看"
  ],
  "以": [
    "可以",
    "所以",
    "以后",
    "以前"
  ],
  "流": [
    "流利",
    "流行",
    "交流",
    "潮流"
  ],
  "平": [
    "公平",
    "平安",
    "平常",
    "平等"
  ],
  "物": [
    "动物",
    "动物园",
    "礼物",
    "食物"
  ],
  "感": [
    "感到",
    "感动",
    "感觉",
    "感谢"
  ],
  "法": [
    "办法",
    "方法",
    "看法",
    "想法"
  ],
  "接": [
    "接到",
    "接受",
    "接下来",
    "接着"
  ],
  "全": [
    "安全",
    "全部",
    "全国",
    "全家"
  ],
  "入": [
    "进入",
    "入口",
    "收入",
    "深入"
  ],
  "而": [
    "而且",
    "而是",
    "反而",
    "然而"
  ],
  "如": [
    "比如",
    "比如说",
    "不如",
    "例如"
  ],
  "业": [
    "作业",
    "创业",
    "工业",
    "就业"
  ],
  "报": [
    "报名",
    "报纸",
    "日报",
    "晚报"
  ],
  "量": [
    "大量",
    "商量",
    "尽量",
    "力量"
  ],
  "部": [
    "部分",
    "大部分",
    "全部",
    "一部分"
  ],
  "经": [
    "经常",
    "经过",
    "经理",
    "已经"
  ],
  "利": [
    "流利",
    "顺利",
    "利用",
    "胜利"
  ],
  "所": [
    "所以",
    "所有",
    "场所",
    "所长"
  ],
  "眼": [
    "眼睛",
    "眼前",
    "眼镜",
    "眼泪"
  ],
  "空": [
    "空气",
    "有空儿",
    "空调",
    "空儿"
  ],
  "数": [
    "大多数",
    "多数",
    "分数",
    "人数"
  ],
  "表": [
    "表示",
    "手表",
    "表达",
    "表格"
  ],
  "加": [
    "参加",
    "加油",
    "更加",
    "加工"
  ],
  "结": [
    "结果",
    "结实",
    "结合",
    "结婚"
  ],
  "求": [
    "请求",
    "要求",
    "需求",
    "征求"
  ],
  "取": [
    "取得",
    "采取",
    "取消",
    "争取"
  ],
  "提": [
    "提出",
    "提到",
    "提高",
    "提前"
  ],
  "位": [
    "单位",
    "座位",
    "各位",
    "地位"
  ],
  "受": [
    "接受",
    "难受",
    "受到",
    "感受"
  ],
  "特": [
    "特别",
    "特点",
    "特色",
    "独特"
  ],
  "应": [
    "答应",
    "应该",
    "反应",
    "适应"
  ],
  "论": [
    "讨论",
    "不论",
    "理论",
    "辩论"
  ],
  "养": [
    "营养",
    "疗养",
    "培养",
    "养成"
  ],
  "原": [
    "原来",
    "原因",
    "原料",
    "原则"
  ],
  "照": [
    "护照",
    "照顾",
    "照片",
    "照相"
  ],
  "复": [
    "重复",
    "复习",
    "反复",
    "复印"
  ],
  "务": [
    "服务",
    "公务员",
    "任务",
    "服务员"
  ],
  "带": [
    "带来",
    "带动",
    "带领",
    "带有"
  ],
  "计": [
    "计划",
    "计算机",
    "计算",
    "设计"
  ],
  "画": [
    "画家",
    "画儿",
    "图画",
    "动画片"
  ],
  "清": [
    "清楚",
    "清醒",
    "清晨",
    "清理"
  ],
  "推": [
    "推动",
    "推广",
    "推进",
    "推开"
  ],
  "往": [
    "交往",
    "前往",
    "往往",
    "以往"
  ],
  "办": [
    "办法",
    "办公室",
    "怎么办",
    "办理"
  ],
  "变": [
    "变成",
    "改变",
    "变化",
    "变为"
  ],
  "单": [
    "菜单",
    "单位",
    "名单",
    "单元"
  ],
  "改": [
    "改变",
    "改进",
    "改造",
    "修改"
  ],
  "近": [
    "最近",
    "将近",
    "接近",
    "近期"
  ],
  "举": [
    "举手",
    "举行",
    "举办",
    "举动"
  ],
  "科": [
    "科学家",
    "科学",
    "科技",
    "本科"
  ],
  "片": [
    "图片",
    "药片",
    "影片",
    "照片"
  ],
  "顺": [
    "顺利",
    "一路顺风",
    "顺序",
    "顺便"
  ],
  "思": [
    "不好意思",
    "意思",
    "有意思",
    "思想"
  ],
  "算": [
    "打算",
    "计算机",
    "计算",
    "总算"
  ],
  "选": [
    "选手",
    "挑选",
    "选择",
    "当选"
  ],
  "夜": [
    "半夜",
    "夜里",
    "夜间",
    "黑夜"
  ],
  "直": [
    "一直",
    "直接",
    "简直",
    "直播"
  ],
  "装": [
    "安装",
    "服装",
    "装修",
    "装置"
  ],
  "便": [
    "方便",
    "方便面",
    "便宜",
    "随便"
  ],
  "活": [
    "干活儿",
    "活动",
    "生活",
    "活力"
  ],
  "留": [
    "留下",
    "留学生",
    "保留",
    "留学"
  ],
  "其": [
    "其他",
    "其中",
    "其次",
    "其实"
  ],
  "示": [
    "表示",
    "显示",
    "暗示",
    "示范"
  ],
  "味": [
    "味道",
    "味儿",
    "意味着",
    "风味"
  ],
  "游": [
    "旅游",
    "游客",
    "游戏",
    "游泳"
  ],
  "队": [
    "队长",
    "排队",
    "球队",
    "队员"
  ],
  "红": [
    "红色",
    "红茶",
    "红酒",
    "红包"
  ],
  "级": [
    "高级",
    "年级",
    "中级",
    "班级"
  ],
  "急": [
    "紧急",
    "急忙",
    "着急",
    "急救"
  ],
  "食": [
    "食物",
    "美食",
    "食品",
    "粮食"
  ],
  "随": [
    "随便",
    "随时",
    "随手",
    "跟随"
  ],
  "题": [
    "难题",
    "问题",
    "标题",
    "话题"
  ],
  "温": [
    "气温",
    "温度",
    "温暖",
    "降温"
  ],
  "餐": [
    "快餐",
    "晚餐",
    "午餐",
    "西餐"
  ],
  "倒": [
    "倒闭",
    "倒车",
    "倒是",
    "摔倒"
  ],
  "共": [
    "公共汽车",
    "一共",
    "公共",
    "共同"
  ],
  "顾": [
    "顾客",
    "照顾",
    "不顾",
    "顾问"
  ],
  "件": [
    "条件",
    "电子邮件",
    "事件",
    "文件"
  ],
  "使": [
    "使用",
    "大使馆",
    "促使",
    "使劲"
  ],
  "酒": [
    "酒店",
    "红酒",
    "啤酒",
    "酒吧"
  ],
  "离": [
    "离开",
    "离婚",
    "距离",
    "离不开"
  ],
  "礼": [
    "礼物",
    "婚礼",
    "典礼",
    "礼拜"
  ],
  "必": [
    "必须",
    "必然",
    "必要",
    "不必"
  ],
  "称": [
    "名称",
    "称为",
    "称赞",
    "称号"
  ],
  "低": [
    "降低",
    "低于",
    "低头",
    "低温"
  ],
  "确": [
    "正确",
    "准确",
    "明确",
    "确保"
  ],
  "室": [
    "办公室",
    "教室",
    "实验室",
    "卧室"
  ],
  "停": [
    "停车",
    "停车场",
    "停止",
    "停下"
  ],
  "换": [
    "交换",
    "更换",
    "转换",
    "变换"
  ],
  "久": [
    "不久",
    "多久",
    "好久",
    "长久"
  ],
  "市": [
    "超市",
    "市长",
    "城市",
    "市场"
  ],
  "万": [
    "千万",
    "万一",
    "成千上万",
    "鹏程万里"
  ],
  "药": [
    "药店",
    "药片",
    "药水",
    "药物"
  ],
  "由": [
    "自由",
    "理由",
    "由于",
    "由此"
  ],
  "周": [
    "上周",
    "下周",
    "周末",
    "周年"
  ],
  "查": [
    "检查",
    "调查",
    "查询",
    "查出"
  ],
  "短": [
    "短信",
    "短处",
    "短裤",
    "短期"
  ],
  "满": [
    "不满",
    "满意",
    "充满",
    "满足"
  ],
  "排": [
    "排队",
    "排球",
    "安排",
    "排名"
  ],
  "完": [
    "完成",
    "完全",
    "完美",
    "完善"
  ],
  "闻": [
    "新闻",
    "丑闻",
    "传闻",
    "耳闻目睹"
  ],
  "像": [
    "好像",
    "偶像",
    "摄像",
    "摄像机"
  ],
  "园": [
    "动物园",
    "公园",
    "花园",
    "校园"
  ],
  "者": [
    "或者",
    "读者",
    "记者",
    "志愿者"
  ],
  "只": [
    "只能",
    "只要",
    "只好",
    "只是"
  ],
  "超": [
    "超过",
    "超市",
    "超级",
    "超越"
  ],
  "例": [
    "例如",
    "例子",
    "比例",
    "例外"
  ],
  "适": [
    "合适",
    "适合",
    "适应",
    "适用"
  ],
  "态": [
    "态度",
    "状态",
    "动态",
    "心态"
  ],
  "讨": [
    "讨论",
    "讨厌",
    "探讨",
    "检讨"
  ],
  "许": [
    "许多",
    "也许",
    "或许",
    "不许"
  ],
  "组": [
    "小组",
    "组成",
    "组长",
    "分组"
  ],
  "背": [
    "背后",
    "背景",
    "背包",
    "背心"
  ],
  "参": [
    "参观",
    "参加",
    "参考",
    "参与"
  ],
  "灯": [
    "灯光",
    "电灯",
    "台灯",
    "灯笼"
  ],
  "典": [
    "词典",
    "字典",
    "典型",
    "经典"
  ],
  "广": [
    "广场",
    "广告",
    "广播",
    "广大"
  ],
  "黑": [
    "黑板",
    "黑色",
    "黑暗",
    "黑夜"
  ],
  "讲": [
    "讲话",
    "听讲",
    "讲究",
    "讲座"
  ],
  "卡": [
    "信用卡",
    "银行卡",
    "贺卡",
    "磁卡"
  ],
  "刻": [
    "立刻",
    "深刻",
    "时刻",
    "此刻"
  ],
  "轻": [
    "年轻",
    "轻松",
    "轻易",
    "减轻"
  ],
  "司": [
    "公司",
    "司机",
    "寿司",
    "打官司"
  ],
  "响": [
    "影响",
    "反响",
    "影响力",
    "响声"
  ],
  "印": [
    "打印",
    "复印",
    "印象",
    "印刷"
  ],
  "育": [
    "教育",
    "体育",
    "体育场",
    "体育馆"
  ],
  "更": [
    "更加",
    "更换",
    "更新",
    "变更"
  ],
  "划": [
    "计划",
    "划船",
    "规划",
    "划分"
  ],
  "角": [
    "角度",
    "角色",
    "主角",
    "角落"
  ],
  "克": [
    "千克",
    "克服",
    "巧克力",
    "克隆"
  ],
  "练": [
    "练习",
    "教练",
    "训练",
    "熟练"
  ],
  "卖": [
    "外卖",
    "买卖",
    "出卖",
    "倒卖"
  ],
  "千": [
    "千克",
    "千万",
    "成千上万",
    "千变万化"
  ],
  "堂": [
    "课堂",
    "食堂",
    "教堂",
    "礼堂"
  ],
  "王": [
    "老王",
    "小王",
    "国王",
    "王后"
  ],
  "油": [
    "加油",
    "石油",
    "加油站",
    "汽油"
  ],
  "越": [
    "越来越",
    "超越",
    "穿越",
    "跨越"
  ],
  "占": [
    "占领",
    "占有",
    "占据",
    "霸占"
  ],
  "座": [
    "座位",
    "讲座",
    "让座",
    "座谈会"
  ],
  "板": [
    "黑板",
    "老板",
    "地板",
    "板块"
  ],
  "才": [
    "刚才",
    "才能",
    "人才",
    "天才"
  ],
  "层": [
    "层次",
    "层面",
    "高层",
    "层出不穷"
  ],
  "段": [
    "阶段",
    "手段",
    "地段",
    "段落"
  ],
  "封": [
    "信封",
    "封闭",
    "封顶",
    "封建"
  ],
  "凉": [
    "凉快",
    "凉水",
    "凉鞋",
    "荒凉"
  ],
  "旅": [
    "旅客",
    "旅行",
    "旅游",
    "旅馆"
  ],
  "绿": [
    "绿色",
    "绿茶",
    "绿化",
    "碧绿"
  ],
  "因": [
    "因为",
    "原因",
    "因此",
    "因而"
  ],
  "掉": [
    "去掉",
    "掉队",
    "掉头",
    "丢掉"
  ],
  "检": [
    "检查",
    "检测",
    "体检",
    "检验"
  ],
  "借": [
    "借鉴",
    "借口",
    "借条",
    "借用"
  ],
  "拉": [
    "拉开",
    "阿拉伯语",
    "拉动",
    "拉拢"
  ],
  "脸": [
    "脸盆",
    "脸色",
    "笑脸",
    "愁眉苦脸"
  ],
  "碰": [
    "碰到",
    "碰见",
    "碰钉子",
    "碰巧"
  ],
  "普": [
    "普通",
    "普通话",
    "普遍",
    "普及"
  ],
  "青": [
    "青年",
    "青少年",
    "青春",
    "青春期"
  ],
  "套": [
    "手套",
    "套餐",
    "外套",
    "配套"
  ],
  "鞋": [
    "球鞋",
    "高跟鞋",
    "皮鞋",
    "凉鞋"
  ],
  "已": [
    "已经",
    "早已",
    "不得已",
    "不已"
  ],
  "英": [
    "英文",
    "英语",
    "英勇",
    "英雄"
  ],
  "嘴": [
    "嘴巴",
    "插嘴",
    "吵嘴",
    "咧嘴"
  ],
  "词": [
    "词典",
    "词语",
    "生词",
    "词汇"
  ],
  "份": [
    "月份",
    "身份证",
    "身份",
    "份额"
  ],
  "惯": [
    "习惯",
    "惯例",
    "惯性",
    "娇惯"
  ],
  "忽": [
    "忽然",
    "忽视",
    "忽略",
    "忽高忽低"
  ],
  "街": [
    "街道",
    "大街",
    "街头",
    "大街小巷"
  ],
  "怕": [
    "可怕",
    "害怕",
    "恐怕",
    "哪怕"
  ],
  "省": [
    "节省",
    "省钱",
    "反省",
    "省略"
  ],
  "熟": [
    "成熟",
    "熟人",
    "熟练",
    "熟悉"
  ],
  "阳": [
    "太阳",
    "阳光",
    "阳台",
    "太阳能"
  ],
  "阴": [
    "阴天",
    "阴谋",
    "阴影",
    "阴暗"
  ],
  "租": [
    "出租",
    "出租车",
    "房租",
    "租金"
  ],
  "刚": [
    "刚才",
    "刚刚",
    "刚好",
    "刚毅"
  ],
  "够": [
    "不够",
    "能够",
    "足够",
    "够呛"
  ],
  "黄": [
    "黄色",
    "黄瓜",
    "黄金",
    "黄昏"
  ],
  "或": [
    "或者",
    "或许",
    "或是",
    "或多或少"
  ],
  "脚": [
    "脚步",
    "脚印",
    "手脚",
    "指手画脚"
  ],
  "靠": [
    "可靠",
    "依靠",
    "靠近",
    "靠拢"
  ],
  "蓝": [
    "蓝色",
    "蓝领",
    "蓝天",
    "蓝图"
  ],
  "墙": [
    "墙壁",
    "城墙",
    "防火墙",
    "围墙"
  ],
  "让": [
    "转让",
    "让座",
    "让步",
    "退让"
  ],
  "铁": [
    "地铁",
    "地铁站",
    "铁路",
    "高铁"
  ],
  "银": [
    "银行",
    "银行卡",
    "银牌",
    "银幕"
  ],
  "迎": [
    "欢迎",
    "迎接",
    "迎来",
    "迎合"
  ],
  "钟": [
    "分钟",
    "闹钟",
    "钟头",
    "警钟"
  ],
  "遍": [
    "普遍",
    "遍地",
    "遍布"
  ],
  "吹": [
    "吹了",
    "吹牛",
    "吹捧"
  ],
  "但": [
    "不但",
    "但是",
    "但愿"
  ],
  "己": [
    "自己",
    "身不由己",
    "损人利己",
    "知己"
  ],
  "际": [
    "国际",
    "实际",
    "实际上",
    "交际"
  ],
  "末": [
    "周末",
    "期末",
    "末日"
  ],
  "弄": [
    "嘲弄",
    "卖弄",
    "弄虚作假"
  ],
  "瓶": [
    "瓶子",
    "花瓶",
    "瓶颈"
  ],
  "且": [
    "而且",
    "并且",
    "况且"
  ],
  "疼": [
    "心疼",
    "疼痛",
    "头疼"
  ],
  "姓": [
    "姓名",
    "老百姓",
    "姓氏"
  ],
  "宜": [
    "便宜",
    "不宜",
    "事宜",
    "适宜"
  ],
  "永": [
    "永远",
    "永不",
    "永恒",
    "永久"
  ],
  "脏": [
    "心脏",
    "心脏病",
    "肝脏"
  ],
  "纸": [
    "报纸",
    "图纸",
    "造纸术"
  ],
  "饱": [
    "饱和",
    "饱满"
  ],
  "晨": [
    "早晨",
    "清晨",
    "凌晨"
  ],
  "懂": [
    "懂得",
    "懂事"
  ],
  "该": [
    "应该",
    "活该"
  ],
  "睛": [
    "眼睛",
    "画龙点睛",
    "目不转睛"
  ],
  "句": [
    "句子",
    "一句话"
  ],
  "哭": [
    "哭泣",
    "哭笑不得"
  ],
  "爬": [
    "爬山",
    "连滚带爬"
  ],
  "晴": [
    "晴天",
    "晴朗"
  ],
  "舒": [
    "舒服",
    "舒适",
    "舒畅"
  ]
};
